{
  "News": [
    {
      "id": 0,
      "title": "LUPIN POSITIVE FACTS DURING A COVID-19 PANDEMIC",
      "description": " Lupin has received an Establishment Inspection Report (EIR) from the USFDA for its manufacturing plant in Nagpur, Aurangabad and Mandideep with no action indicated.  Lupin has launched generic Mycophenolic acid delayed-release tablets of 180 mg and 360 mg. It is used to prevent organ rejection in patients receiving kidney transplants in the US market. ",
      "imageUrl": "https://www.dsij.in/Portals/0/EasyDNNNews/12279/600600p10163EDNmainimg-img-Lupin.jpg"
    },
    {
      "id": 1,
      "title": "FMCG LEADER “HUL” INITIATIVES AGAINST CORONA VIRUS",
      "description": "HUL has committed Rs 100 crore to help in the fight against coronavirus. The company will also donate 2 crores pieces of Lifebuoy soaps and donate Rs 10 crore to upgrade the health care facilities in testing centers and hospitals. Hindustan Unilever has collaborated with UNICEF for a mass communication campaign to inform the public against the COVID-19 pandemic. ",
      "imageUrl": "https://res.cloudinary.com/people-matters/image/upload/fl_immutable_cache,w_624,h_351,q_auto,f_auto/v1543907601/1543907600.jpg"
    },
    {
      "id": 2,
      "title": "NATIONWIDE LOCK DOWN AFFECTS ON INVESTOR",
      "description": "Health insurance players will also get a new growth cover as individuals gradually shift health insurance to essential spending. The investor preferences are changing towards sectors like chemicals and pharmaceuticals. Demand cooldown for cooling appliances makers due to lockdown.  The lockdown impact will change investor behaviour towards fresh home purchases hitting the residential segment for some time. ",
      "imageUrl": "https://mmo.aiircdn.com/265/5e91e4ad6fd11.jpg"
    },
    {
      "id": 3,
      "title": "BRITANNIA INDUSTRIES POSITIVE FACTS",
      "description": "Britannia Industries could report double-digit growth in consolidated profit in the March quarter due to the lower tax rate. The company declared an interim dividend of Rs 35 per share for the FY-20. The dividend will be paid to the shareholders before May 23, 2020. Britannia has partnered with Dunzo for the home delivery of all its products. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/08/Britannia1-770x433.jpg"
    },
    {
      "id": 4,
      "title": "A DEAL BETWEEN BHARAT EARTH MOVERS LIMITED AND COAL INDIA LIMITED",
      "description": "Coal India signed two purchase pacts totaling nearly Rs 400 crore with state-owned heavy earthmoving machinery manufacturer BEML for buying seven 150-tonne dumpers and eight 190-tonne dumpers. Coal India plans to invest  Rs 7000 crore in acquiring 360-odd heavy mining machinery over the next three-four years to enhance production for achieving a billion tonnes production capacity by 2024.",
      "imageUrl": "https://images.assettype.com/freepressjournal%2F2020-04%2Ff00dd344-026c-4ac3-8bd6-8c321c71afb2%2Fdumper.jpg?rect=0%2C120%2C1280%2C720&format=webp&w=750&dpr=1.3"
    },
    {
      "id": 5,
      "title": "RELIANCE RIGHTS ISSUE UPDATE",
      "description": "Reliance Industries is considering issuing of shares to existing shareholders on a rights basis to reduce its massive debt pile. The proposed rights issue is the first from the company in 29 years.  Reliance Industries will announce its financial results for the March quarter on April 30. RIL also added that it will recommend dividend on equity shares. ",
      "imageUrl": "https://www.jagranimages.com/images/newimg/18102019/18_10_2019-ril_19678369.jpg"
    },
    {
      "id": 6,
      "title": "WHAT IS A RIGHTS ISSUE?",
      "description": "A rights issue is a way by which a listed company can raise additional capital. The company gives its existing shareholders the right to subscribe to newly issued shares in proportion to their existing holdings at a discounted price. For example, 1:4 rights issue means an existing investor can buy one extra share for every existing four shares.",
      "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcTiQsfQEUFB5-kQpJzO99k952MkwaUzQZWnZ5NqLXX-TSwrDmtV&usqp=CAU"
    },
    {
      "id": 7,
      "title": "WHAT IS A PREFERENTIAL ISSUE?",
      "description": "A preferential issue is an issue of shares by listed companies to a select group of investors under Section 81 of the Companies Act, 1956. This is a faster way for a company to raise equity capital. A person holding preferential shares has the right to be paid from company assets before common stockholders if the company goes into bankruptcy.",
      "imageUrl": "https://d1whtlypfis84e.cloudfront.net/guides/wp-content/uploads/2018/03/25151322/DVR-shares-300x215.jpg"
    },
    {
      "id": 8,
      "title": "WHAT IS A FINANCIAL MARKET?",
      "description": "Financial markets are made by buying and selling numerous types of financial securities including equities, bonds, currencies, and derivatives. These are markets where businesses grow their cash, companies decrease risks, and investors make more cash.  It serves as an agent between the investors and collectors. Types of Financial Markets are capital, money, derivatives, and the forex market. ",
      "imageUrl": "https://live.staticflickr.com/977/41145436745_9cf8876bac_b.jpg"
    },
    {
      "id": 9,
      "title": "MARUTI SUZUKI ZERO SALES IN APRIL",
      "description": "The country’s largest carmaker Maruti Suzuki reported zero sales in the domestic market last month with factories shut in action with government orders to prevent the check of the coronavirus pandemic. The carmaker suspended operations from March 22, in line with orders from the government. In FY20, automobile volumes declined and expect a double-digit drop in FY21 sales. ",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-09/09/full/1567971605-2977.jpg"
    },
    {
      "id": 10,
      "title": "RELIANCE INDUSTRIES FY20 Q4 EARNINGS",
      "description": "Reliance Industries (RIL) on April 30 reported an overall profit of Rs 6,348 crore for the March quarter. RIL's overall profit dropped 45.5 percent due to the fall in oil prices triggered by coronavirus but an impressive 72.7 percent sequential growth by Jio Platforms limited the decline. The company announced the terms of a rights issue of Rs 53,125 crore.",
      "imageUrl": "https://assets.vccircle.com/uploads/2019/03/reliance.jpg"
    },
    {
      "id": 11,
      "title": "AFTER 29 YEARS RELIANCE INDUSTRIES ANNOUNCED RIGHTS ISSUE",
      "description": "Reliance Industries (RIL) has announced fundraising of Rs 53,125 crore by way of a 1:15 rights issue. Means one share will be offered for every 15 shares. The board of directors will issue more than 41 crore equity shares at Rs 1,257 each which is 14.31 percent discount to Thursday’s closing price of Rs 1,467 on the BSE. ",
      "imageUrl": "https://images.livemint.com/img/2019/04/24/600x338/RIL_1556084550868.jpg"
    },
    {
      "id": 12,
      "title": "HINDUSTAN UNILEVER FY20 Q4 EARNINGS",
      "description": "FMCG major Hindustan Unilever's Q4FY20 profit declined by 1.2 percent year-on-year to Rs 1,519 crore and revenue fell 9.4 percent YoY to Rs 9,011 crore due to decline in volumes after the lockdown in the second half of March. The company has dropped the prices of hand sanitizers and hand wash by 50 percent and 15 percent respectively. ",
      "imageUrl": "https://www.hul.co.in/Images/India-LUX-new-hand-wash-collection-310818_tcm1255-525690_w400.jpg"
    },
    {
      "id": 13,
      "title": "TECH MAHINDRA FY20 Q4 EARNINGS",
      "description": "Software services firm Tech Mahindra is posted a 29 percent year-on-year (YoY) fall in consolidated net profit at Rs 803.90 crore for the quarter ended March. The company’s revenue in the March quarter rose 6.72 percent to Rs 9,490 crore. The board declared a final dividend of Rs 5 per share and the interim dividend of Rs 10 per share.",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-11/05/full/1572969642-527.jpg"
    },
    {
      "id": 14,
      "title": "NPAs OF BANK OF BARODA RISE 6 TIMES IN 6 YEARS",
      "description": "Non-performing assets of Bank of Baroda (BoB) rose from Rs 11,876 crore at March-end 2014 to Rs 73,140 crore at December-end 2019.  The number of NPA accounts rose from 2,08,035 as of March 31, 2014, to 6,17,306 as of December 2019. Bank of Baroda collected Rs 107.7 crore through the SMS alert fee in the last 2 years. ",
      "imageUrl": "https://images.livemint.com/img/2019/08/26/600x338/BankofBaroda_1554006973769_1566817622477.jpg"
    },
    {
      "id": 15,
      "title": "ASIAN PAINTS MAKE HAND SANITIZERS  ",
      "description": "India’s largest decorative paint maker Asian Paints announced that it will start making hand and surface sanitizers under the Viroprotek brand and it will be available in the market from next week. The sanitizer is being manufactured at the Asian Paints plant in Ankleshwar, Gujarat and the company has obtained all necessary permissions from authorities. ",
      "imageUrl": "https://img.etimg.com/thumb/msid-53560228,width-300,imgsize-164553,resizemode-4/asian-paints-to-enhance-manufacturing-capacity.jpg"
    },
    {
      "id": 16,
      "title": "BAJAJ AUTO ZERO SALES IN APRIL",
      "description": "Bajaj Auto did not sell any two-wheelers or commercial vehicles in the domestic market in April. The company shipped 32,009 two-wheeler units to overseas markets last month. The company managed to export 5,869 commercial vehicle units in the last month. Bajaj Auto sold a total of 37,878 units last month, down 91 percent from 4,23,315 units in April 2019.",
      "imageUrl": "https://www.bajajauto.com/intracityvehicles/img/banner1.jpg"
    },
    {
      "id": 17,
      "title": "ASIAN PAINTS PARTIALLY RESUMES OPERATIONS",
      "description": "Asian Paints has partially resumed operations at some of its manufacturing locations, warehouses, and offices where lockdown restrictions have been eased. The operations at these locations will be carried out in accordance with the guidelines issued by the regulatory authorities. The company had disruption of operations across the country on account of the COVID -19 pandemic. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/04/Paints-e1548221251733-770x433.jpg"
    },
    {
      "id": 18,
      "title": "TCS LAUNCHES ARTIFICIAL INTELLIGENCE (AI) POWERED CLOUD BASED SOLUTION",
      "description": "Tata Consultancy Services launch an AI-powered, cloud-based solution to detect wafer abnormal in semiconductor manufacturing. TCS WaferWise automatically detects defects, improves product quality, and enhances business growth. The solution harnesses the company's contextual knowledge of the semiconductor industry and the power of deep learning technology, to help chipmakers digitally re-imagine their product quality assurance process. ",
      "imageUrl": "https://www.domain-b.com/companies/companies_t/tcs/images/TCS-Hangzhou-Software-Park-23-apr.jpg"
    },
    {
      "id": 19,
      "title": "FORD INDIA LAUNCHES CONTACTLESS SALES SERVICE",
      "description": "Ford India announced the launch of contactless sales and service of vehicles as its dealerships on maintaining social distancing norms in the wake of coronavirus pandemic. The new procedure called \"Dial-A-Ford\" will allow a prospective customer to book, test drive, or even get the delivery of the new vehicle at his or her doorstep. ",
      "imageUrl": "https://cdn.autoportal.com/img/news/14739/main/5a46164e40c27ad321c6071f5946fd81/main_cropped.jpg"
    },
    {
      "id": 20,
      "title": "THREE IPOs POSTPONES DUE TO COVID-19 PANDEMIC",
      "description": "Equitas Small Finance Bank on March 18 will postpone the launch of its initial public offering due to coronavirus-led weak market conditions. The issue consisted of a fresh issue of Rs 550 crore and an offer for sale of 8 crore shares.  Burger King and Rossari Biotech were also postponed their IPOs scheduled to open on March 18. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/03/Initial_public_offering_ipo_bank_1280x720-770x433.jpg"
    },
    {
      "id": 21,
      "title": "MARUTI SUZUKI RESUME PRODUCTION AT MANESAR FROM MAY 12",
      "description": "Country's largest carmaker Maruti Suzuki will resume production of vehicles at Manesar facility from May 12. \"All activities would be carried out strictly per the Government regulations and guidelines. The process ensures the highest level of hygiene and sanitization across all its showrooms for the safety of its customers and employees. ",
      "imageUrl": "https://www.dsij.in/Portals/0/EasyDNNNews/11202/600600p10163EDNmainimg-MarutiSuzuki.jpg"
    },
    {
      "id": 22,
      "title": "RELIANCE INDUSTRIES CONSIDERS SALE OF ASIAN PAINTS STAKE",
      "description": "Reliance Industries is considering selling its stake in India’s largest paint maker valued at about $989 million to trim its debt. Mukesh Ambani Asia’s richest person, is in discussions with banks for a potential sale of its 4.9 percent stake in Asian Paints. Reliance could decide not to proceed with a deal. ",
      "imageUrl": "https://content.indiainfoline.com/_media/iifl/img/misc/2015-02/23/full/reliance-industries-1424684108-8302300.jpg"
    },
    {
      "id": 23,
      "title": "TRADING CALL ON HINDUSTAN UNILEVER (HUL) STOCK",
      "description": "The HUL stock chart shows a downtrend for last 1 month. Its trend will become downtrend to uptrend after crossing a price of 2460. Try to buy a stock at 2461 with a target of 2635. Put a stop loss of 2283. Time Horizon of a trade is 10-20 days. HUL share current market price is 2078. ",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1580479103_fi9VzX_1664314_image_1521484347.jpg"
    },
    {
      "id": 24,
      "title": "TRADING CALL ON A TCS STOCK",
      "description": "The TCS stock chart shows an uptrend for the last 1 month. Its trend will become uptrend to downtrend after crossing a price of 1858. Try to short sell a stock in 1857 with a target of 1683. Put a stop loss of 1977. Time Horizon of a trade is 10-15 days. TCS share current market price is 1897.",
      "imageUrl": "https://www.businessinsider.in/thumb/msid-70146460,width-600,resizemode-4,imgsize-1808277/business/tcs-plans-to-hire-18000-freshers-in-next-3-months/tcs.jpg"
    },
    {
      "id": 25,
      "title": "HERO MOTOCORP SALE 10,000 TWO-WHEELERS",
      "description": "The country’s largest two-wheeler manufacturer Hero MotoCorp has sold 10,000 motorcycles and scooters since re-opening customer touchpoints last week. It reopened three of its manufacturing plants at Dharuhera and Gurgaon in Haryana and Haridwar in Uttarakhand. Hero MotoCorp has also conducted intense training programs though webinars reaching 700 internal sales, after-sales employees, and over 7000 customer touch-points.",
      "imageUrl": "https://images.financialexpress.com/2019/09/1-349.jpg"
    },
    {
      "id": 26,
      "title": "SOVEREIGN GOLD BOND SCHEME 2020-21 SERIES-2 FOR INVESTORS",
      "description": "The Sovereign Gold Bond Scheme 2020-21-Series-2 will be opened for subscription for the period from May 11, 2020, to May 15, 2020.  The issue price of Gold Bond is ₹4,540 per gram of gold after getting a discount of ₹50 per gram on the nominal value of ₹4,590 from Reserve Bank of India to those investors applying online.",
      "imageUrl": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/ef7xroru4aatfwb_660_070120125508_110520124451.jpg"
    },
    {
      "id": 27,
      "title": "TRADING CALL ON A KOTAK BANK STOCK",
      "description": "The KOTAK stock chart shows a downtrend for the last 2 months and 15 days. Its trend will become down to up after crossing a price of 1302. Try to buy a stock at 1303 with a target of 1491. Put a stop loss of 1252. Time Horizon of a trade is 30-40 days. KOTAK current market price is 1191.",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1469729425_YucbAp_kotak.jpg"
    },
    {
      "id": 28,
      "title": "TRADING CALL ON A L&T FINANCE STOCK",
      "description": "The L&T FINANCE stock chart shows a downtrend for the last 2 months. Its trend will become down to up after crossing a price of 70. Try to buy a stock at 71 with a target of 95. Put a stop loss of 49. Time Horizon of a trade is 30-40 days. L&T FINANCE share current market price is 62.",
      "imageUrl": "https://media.glassdoor.com/l/4b/96/e9/fd/ltfs-ho-3.jpg"
    },
    {
      "id": 29,
      "title": "FACTS OF SOVEREIGN GOLD BOND SCHEME 2020",
      "description": "1) Get a 2.5% interest annually in this scheme. But the interest is taxable. \n2) Its lock-in period is 8 years. But no long term capital gain charged after the 8 years.\n3) It has an exit plan after the 5 years. But long term capital gain is applicable. \n4) This scheme is risk-free.\n5) No making and GST charges on it.",
      "imageUrl": "https://i10.dainikbhaskar.com/thumbnails/813x548/web2images/www.bhaskar.com/2020/05/11/25_1589171500.jpg",
      "type": "news"
    },
    {
      "id": 30,
      "title": "TRADING CALL ON A BATA STOCK",
      "description": "The BATA stock chart shows a downtrend for the last 3 months and 10 days. Its trend will become down to up after crossing a price of 1405. Try to buy a stock at 1406 with a target of 1811. Put a stop loss of 1190. Time Horizon of a trade is 10-30 days. BATA share market price is 1349.",
      "imageUrl": "https://www.forummalls.in/wp-content/uploads/malls/Vijaya/new_bg/bata/fvm_bata_g2.jpg"
    },
    {
      "id": 31,
      "title": "GENERAL ATLANTIC INVEST 6,598.38 CRORE IN JIO PLATFORMS",
      "description": "Private equity firm General Atlantic will invest Rs 6,598.38 crore in Jio Platforms at an equity value of Rs 4.91 lakh crore and an enterprise value of Rs 5.16 lakh crore. This will be the fourth investment in the Jio Platform following those of Facebook, Silver Lake, and Vista Equity Partners. General Atlantic’s will buy a 1.34% equity stake. ",
      "imageUrl": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_05_2020_12_35_23_9082047.jpg?width=920&format=webp"
    },
    {
      "id": 32,
      "title": "RIL RIGHTS ISSUE OPEN ON MAY 20",
      "description": "Reliance Industries rights issue will open on May 20 and close on June 3 and offer partly paid-up shares to its existing shareholders. The company will raise up to Rs 53,036.13 crore of which Rs 39,755.08 crore used for paring debt. RIL is offering one share at Rs 1,257 to existing shareholders for every 15 held in the company. ",
      "imageUrl": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/ril_660_191119022942_090120020626_140520105020.jpg"
    },
    {
      "id": 33,
      "title": "KOTAK MAHINDRA BANK ALLOW VIDEO KYC",
      "description": "Kotak Mahindra Bank has introduced a video-KYC facility for customers opening savings accounts on Kotak 811 - the bank's digital banking platform. It is the first private Indian bank to offer a video-based \"zero-contact\" onboarding service. With Video KYC, verification of documents, signature are completed via a video call with a representative from the bank without any physical interface. ",
      "imageUrl": "https://images.financialexpress.com/2020/02/Video-KYC-small.jpg"
    },
    {
      "id": 34,
      "title": "BAJAJ FINANCE FY20 HIGHLIGHTS",
      "description": "1) Bajaj Finance posted a 19.38 percent year-on-year (YoY) fall in net profit at Rs 948.10 crore for the Q4FY20.\n2) The company made provisions of Rs 1,954 crore in Q4FY20 against Rs 409 crore in Q4FY19.\n3) The company has lost 10 productive days in Q4FY20.\n4) New loans booked during the quarter increased by 3 percent YoY to Rs 60.3 lakh.",
      "imageUrl": "https://www.dynamiclevels.com/wp-content/uploads/2016/08/babaj-finance.jpg",
      "type": "news"
    },
    {
      "id": 35,
      "title": "TATA STEEL Q4FY20 RESULTS",
      "description": "Tata Steel reported a consolidated net profit of Rs 5.93 crore for the Q4FY20. The company had posted a consolidated net loss of Rs 212.41 crore in the last year. Tata Steel consolidated total income declined to Rs 4,288.87 crore, over Rs 5,547.71 crore in the last year. There is a financial risk for the company due to COVID-19.",
      "imageUrl": "https://www.hrkatha.com/wp-content/uploads/2017/12/2fa8710abe28570bdc2ae8034cc5a716.jpg"
    },
    {
      "id": 36,
      "title": "COLGATE PALMOLIVE Q4FY20 RESULTS",
      "description": "Colgate-Palmolive posted a 3.32 percent year-on-year rise in net profit at Rs 204.15 crore for the Q4FY20. The company reported a 7.40 percent YoY drop in net sales at Rs 1,062.4 crore with an 8 percent YoY decline in volumes due to the ongoing Covid-19 situation. The company also declared a second interim dividend of Rs 16 per share. ",
      "imageUrl": "https://www.mbaskool.com/2017_images/stories/aug-images/mktgmx-colgatepalmolive.jpg"
    },
    {
      "id": 37,
      "title": "KKR INVEST 11,367 CRORE IN JIO PLATFORMS",
      "description": "Private equity firm KKR is set to invest Rs 11367 crore in Jio Platforms for a 2.32% stake. This will be the fifth investment in the Reliance Industries Ltd (RIL) business. With the latest deal, Jio Platforms will get a combined Rs78,562 crore from the five investments. KKR is an American global investment firm that manages multiple alternative asset classes.",
      "imageUrl": "https://www.gizbot.com/img/2020/05/xkkr-to-invest-rs-11367-crore-in-jio-platforms-for-2-32-stake1-1590130749.jpg.pagespeed.ic.tjgPvEsKLb.jpg"
    },
    {
      "id": 38,
      "title": "SECOND TRANCHE OF BHARAT BOND ETF COMING",
      "description": "Edelweiss Asset Management would launch the second tranche of Bharat Bond ETF in July with two new series to raise up to Rs 14,000 crore from the market. The two new series will have maturities of April 2025 and April 2031. Bond ETF invests in AAA-rated public sector companies including EXIM Bank, HPCL, HUDCO, NHAI, NHPC, NTPC, NABARD, and SIDBI.",
      "imageUrl": "https://www.basunivesh.com/wp-content/uploads/2019/12/Edelweiss-Bharat-Bond-ETF.jpg",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/bonds/second-tranche-of-bharat-bond-etf-coming-aims-to-raise-rs-14000-crore/articleshow/75886430.cms"
    },
    {
      "id": 39,
      "title": "FACTS OF BHARAT BOND EXCHANGE TRADED FUND",
      "description": "1) It has a fixed maturity date.\n2) It achieves to track the returns provided by the Nifty BHARAT Bond Index.\n3) This bond has no lock-in period.\n4) It provides relatively stable returns with lower taxes over the maturity period.\n5) The minimum and maximum investment amount is Rs.1000 and Rs 2,00,000 for the retail investors.\n6) Its managed at 0.0005% cost.",
      "imageUrl": "https://cdn.zeebiz.com/sites/default/files/styles/zeebiz_850x478/public/2020/01/08/108663-bharat-bond-etf-1.jpg?itok=00WPsONh&c=c5af8c0f92ccc8e249257bf0f1cb18e8",
      "type": "news"
    },
    {
      "id": 40,
      "title": "WHAT IS AN ETF?",
      "description": "An exchange-traded fund (ETF) is a basket of securities that trade on an exchange, just like a stock. ETF share prices fluctuate all day as the ETF is bought and sold; this is different from mutual funds that only trade once a day after the market closes. ETFs offer low managed costs and fewer broker commissions than buying the stocks.",
      "imageUrl": "https://images.financialexpress.com/2019/07/ETF-1.jpg",
      "type": "learn",
      "fullArticleLink": "https://www.investopedia.com/terms/e/etf.asp"
    },
    {
      "id": 41,
      "title": "HDFC LTD Q4FY20 RESULTS",
      "description": "HDFC LTD reported a 21.97 percent year-on-year (YoY) fall in net profit from Rs 2,862 crore which was reported in the Q4 of the last year. The mortgage lender has reported a profit of Rs 2,233 crore for the Q4FY20. Net interest income (NII) for the quarter rose 17 percent to Rs 3,780 crore compared with Rs 3,238 crore in the year-ago quarter. The HDFC board announced a dividend of Rs 21 per share for FY20. ",
      "imageUrl": "https://lh3.googleusercontent.com/8SuaM8yGXtFGgjkyMQUjHaFG5_w9rA7jFkvTFCA-re_tjH21WfF0TjdqOlMtWhaxLlayI8B1=w1080-h608-p-no-v0",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-q4-results-profit-drops-22-yoy-to-rs-2233-crore-firm-announces-dividend-of-rs-21-per-share/articleshow/75970203.cms"
    },
    {
      "id": 42,
      "title": "D-MART Q4FY20 RESULTS",
      "description": "Avenue Supermarts which owns and operates supermarket chain D-Mart, consolidated net profit for the Q4FY20 rose 41.6 percent to Rs 271.28 crore. Total revenue for the Q4FY20 stood at Rs 6,255.93 crore, up 23.6 percent from Rs 5,061.65 crore posted in the same period last year. Net profit margin improved to 4.3 percent. Its revenue in April was down by more than 45 percent as compared to the last year. ",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Dmart_tirupati.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/avenue-supermarts-q4-results-profit-jumps-42-yoy-to-rs-272-crore-revenue-rises-24/articleshow/75917933.cms"
    },
    {
      "id": 43,
      "title": "WHAT IS A NET PROFIT MARGIN ?",
      "description": "The net profit margin is the ratio of net profit to revenue for a company that is multiplied by 100. Net profit is the gross profit minus operating expenses and all other expenses, such as taxes and interest paid on debt. Its formulas are Net Profit Margin= (NP/R)*100. Net profit(NP)=Gross Profit-OE-O-I-T, R=Revenue, OE=Operating expenses, O=Other expenses, I=Interest and T=Taxes.",
      "imageUrl": "https://publicdomainvectors.org/photos/profitcurve.png",
      "type": "learn",
      "fullArticleLink": "https://www.investopedia.com/ask/answers/021215/what-difference-between-gross-profit-margin-and-net-profit-margin.asp"
    },
    {
      "id": 44,
      "title": "MARUTI PARTNERSHIP WITH ICICI BANK",
      "description": "The country's largest carmaker Maruti Suzuki India (MSI) has joined hands with ICICI Bank to offer retail financing schemes to its customers. ICICI Bank is offering a Flexi EMI scheme which enables customers to pay low EMI initially, to help them overcome the liquidity stress due to the COVID-19 pandemic. The EMI amount starts from Rs 899 on a loan of Rs 1 lakh for the first three months.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Maruti_Suzuki_Dzire_VXi_VVT_%28front%29.JPG",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/auto-news/maruti-partners-icici-bank-to-offer-retail-financing-schemes-to-customers/articleshow/76002945.cms"
    },
    {
      "id": 45,
      "title": "JK TYRE CROSSES 2 CRORE PRODUCTION",
      "description": "JK Tyre has crossed 2 crore units production milestone of trucks and bus radial (TBR) tires. The firm had recently launched 'Smart Tyre' technology, which monitors the tire's vital statistics, including pressure and temperature. The company had also launched the next generation of fuel-efficient 'Fuel Saver Technology' TBR tires that save up to 8 percent fuel in comparison to normal radial tires.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/30/JK_Tyre_Logo.png",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/tyres/jk-tyre-crosses-2-crore-units-production-milestone-of-trucks-bus-radial-tyres/articleshow/75996742.cms"
    },
    {
      "id": 46,
      "title": "CEAT Q4FY20 RESULTS",
      "description": "Tire maker Ceat reported a 19.58 percent decline in consolidated net profit at Rs 51.72 crore for the Q4FY20. The company had posted a net profit of Rs 64.32 crore in January-March quarter a year ago. Revenue from operations declined to Rs 6,778.83 crore in FY20 as compared with Rs 6,984.51 crore in 2018-19. The company has resumed operations at most of its factories with easing in lockdown restriction.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/CEAT_Logo.svg/1096px-CEAT_Logo.svg.png",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/ceat-q4-results-net-profit-falls-20-to-rs-52-crore/articleshow/76074508.cms"
    },
    {
      "id": 47,
      "title": "SUN PHARMA CLINICAL TRIAL ON COVID PATIENTS",
      "description": "Drugmaker Sun Pharmaceutical Industries Ltd has received Indian regulatory approval to start clinical trials of a pancreatitis drug in COVID-19 patients. Sun Pharma's pancreatitis drug, nafamostat mesylate, has been identified as a potential candidate for COVID-19 patients by scientists at the University of Tokyo and Leibniz Institute for Primate Research, Germany.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/26/Sun_Pharma_Logo.png",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indias-sun-pharma-to-conduct-clinical-trial-of-pancreatitis-drug-in-covid-19-patients/articleshow/76089435.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 48,
      "title": "INDIA GRID AGREEMENT WITH KALPATARU POWER",
      "description": "India Grid Trust has signed an agreement to acquire a power transmission asset at Jhajjar in Haryana for Rs 310 crore from current owners Kalpataru Power Transmission and Techno Electric & Engineering Company. IndiGrid aims to scale up its power transmission assets under management (AUM) to Rs 30,000 crore by 2022 and has plans to diversify into the solar power sector. This will be the second acquisition by IndiGrid from a company.",
      "imageUrl": "https://p1.pxfuel.com/preview/392/422/405/sunset-electric-pylon-electric-tower-shimoga.jpg",
      "type": "news",
      "fullArticleName": "",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/energy/power/indigrid-to-buy-kalpataru-power-jv-asset-for-rs-310-crore/articleshow/76107797.cms"
    },
    {
      "id": 49,
      "title": "IMPORTED PRODUCTS DELISTED AT CAPF CANTEENS",
      "description": "The Ministry of Home Affairs put on hold a list of non-Swadeshi products not to be sold at Central Armed Police Forces (CAPFs) canteens. The nationwide network of over 1700 CAPF canteens will only sell swadeshi products from June 1, 2020. The products manufactured by firms like Dabur, VIP industries, Eureka Forbes, HUL, Nestle India will not be sold at CAPF canteens anymore as they are prepared from purely imported products.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/70/Central_Police_Canteen%2C_Kollam.jpg",
      "type": "news",
      "fullArticleName": "Economic Times",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/over-1000-non-swadeshi-products-junked-from-capf-canteens/articleshow/76133733.cms"
    },
    {
      "id": 50,
      "title": "ICICI BANK CUTS INTEREST RATE",
      "description": "ICICI Bank has cut the interest rates on saving deposits by 25 basis points (bps). The private sector lender has cut the interest rates on all deposits of less than Rs 50 lakh to 3 percent, as against the existing 3.25 percent. Likewise, for deposits of Rs 50 lakh and above, the account holders will earn an interest of 3.50 percent, down from 3.75 percent currently.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/10/Icici-bandra_kurla_complex.jpg",
      "type": "news",
      "fullArticleName": "",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/banking/finance/banking/icici-bank-cuts-interest-rate-on-saving-deposits-by-25-bps/articleshow/76161027.cms"
    },
    {
      "id": 51,
      "title": "PNB CUTS INTEREST RATE ON SAVINGS ACCOUNT",
      "description": "Punjab National Bank announced to lower interest rate on savings account deposits by 0.50 percentage point, effective July 1. For deposits up to Rs 50 lakh, the new interest rate will be 3 percent, down by 0.50 percent from 3.50 percent. Deposits of Rs 50 lakh and above will earn an interest of 3.25 percent as against 3.75 percent currently. The trimming of interest rate is also on deposits of the SBI, Axis Bank and ICICI Bank.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0e/SBI_ATM_-_panoramio.jpg",
      "type": "news",
      "fullArticleName": "",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/banking/finance/banking/pnb-lowers-rates-on-savings-account-deposits-by-50-bps/articleshow/76183367.cms"
    },
    {
      "id": 52,
      "title": "BHARAT BIOTECH DEVELOP CHIKUNGUNYA VACCINE",
      "description": "The Coalition for Epidemic Preparedness Innovations (CEPI) announced that it is partnering with vaccine maker Bharat Biotech to fund up to $14.1 million (around 106 crore) for the development of a Chikungunya vaccine. CEPI will fund the company for vaccine manufacturing and clinical development of a two-dose live-inactivated vaccine (BBV87) against Chikungunya. Bharat Biotech will further be supported with a grant of $2 million. ",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/58/Bharat_Biotech_Logo.jpg",
      "type": "news",
      "fullArticleName": "Moneycontrol.com",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/companies/bharat-biotech-secures-funding-from-cepi-for-developing-chikungunya-vaccine-5353911.html"
    },
    {
      "id": 53,
      "title": "RAGHAVA LIFE SCIENCES DEVELOPED COVID DRUG",
      "description": "Active pharmaceutical ingredients manufacturer Raghava Life Sciences (RLS), which claims to have developed bulk drug Favipiravir that showed positive results in trials treating the novel Coronavirus disease. Favipiravir, a generic version of Avigan that is used to treat influenza in Japan, is being studied as an experimental drug in treating the novel Coronavirus disease in India, Russia, China, Japan, Turkey, Thailand, and others.",
      "imageUrl": "https://media.defense.gov/2020/Mar/09/2002265190/780/780/0/200309-D-HN545-003.JPG",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/hyderabad-s-raghav-life-sciences-develops-favipiravir-for-covid-19-patients-120060500792_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 54,
      "title": "US DRUG MAKER LAUNCH COVID-19 DRUG",
      "description": "US drugmaker to launch its brand of Covid-19 experimental drug Remdesivir in the country in a July month. Gilead has licensed the drug to four companies i.e Cipla, Mylan, Hetero, and Jubilant Life Sciences for sale in India, but none of these firms have received approval from the drug controller. Most of the four companies are ready with their products and are awaiting a nod from the regulator to manufacture. ",
      "imageUrl": "https://media.defense.gov/2020/Apr/30/2002293722/780/780/0/200429-A-HZ730-1005.JPG",
      "type": "news",
      "fullArticleName": "Economic Times",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indian-licensees-free-to-price-remdesivir-gilead/articleshow/76185458.cms"
    },
    {
      "id": 55,
      "title": "SUN PHARMA PHASE 2 CLINICAL TRIAL",
      "description": "Sun Pharma initiates the Phase 2 clinical trial on AQCH, a phytopharmaceutical drug, as a potential treatment for COVID-19 patients. The clinical trial will be conducted across 12 centers in India in 210 patients. The treatment duration for patients will be 10 days. The results of the clinical trial are expected by October 2020. This is the first phytopharmaceutical drug approved\nfor clinical trials by the DCGI. ",
      "imageUrl": "https://cdn.pixabay.com/photo/2020/03/16/19/45/drug-4938120_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://www.ndtv.com/business/coronavirus-pandemic-news-sun-pharma-testing-plant-based-drug-aqch-as-potential-covid-19-treatment-2241164",
      "fullArticleName": "NDTV"
    },
    {
      "id": 56,
      "title": "Stocks to look for high gains",
      "description": "Castrol India (Rs 125) is fluctuating around its low & have slowly started regaining its pace. Further oil demand is likely to bounce back once industries open and vehicles start running on the road.\nReliance Industries (Price of  ₹1,571.8): Multiple investors like Silver Lake, Facebook & Abu Dhabi Investment Authority (ADIA) have invested in its Jio Platforms.  All these investment values Jio at an equity value of Rs 4.91 lakh crore. ",
      "imageUrl": "https://p1.pxfuel.com/preview/319/313/80/stocks-graph-abstract-accounting-analysis-banking-royalty-free-thumbnail.jpg",
      "type": "call"
    },
    {
      "id": 57,
      "title": "PVR experiencing huge losses due to COVID-19",
      "description": "PVR Ltd reported a net loss of Rs 74.61 crore for the Q4. Due to the coronavirus outbreak in India, theatres had stopped operations since the second week of March which led to 0 collections. Further cinemas are in the last phase of unlocking and even dates of reopening will be decided after assessing the situation. Cinema business in  March have suffered losses of around Rs800 crore & many releases have delayed like Sooryavanshi, Radhe.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f5/PVR_Plaza_No_poster_for_Padmaavati.jpg",
      "type": "news",
      "fullArticleName": "moneycontrol.com",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/earnings/pvr-feels-lockdown-pain-slumps-to-q4-loss-of-rs-74-61-crore-5376301.html"
    },
    {
      "id": 58,
      "title": "Hero MotoCorp started selling there bikes online",
      "description": "In the current times of maintaining social distancing, Hero MotoCorp has started online eSHOP to buy & book two-wheeler from the home. Via eShop user can select the variant of 2 Wheeler colour, city, choose dealer & make payment. After doc verification, the vehicle would be delivered & there a representative will collect physical sign ( that is RTO mandate). Companies who had previously done the same are Harley-Davidson, Suzuki and KTM.",
      "imageUrl": "https://c.pxhere.com/photos/95/ef/photo-89751.jpg!d",
      "type": "news",
      "fullArticleName": "Time Now",
      "fullArticleLink": "https://www.timesnownews.com/auto/bike-news/article/hero-motocorp-eshop-now-buy-hero-scooters-and-bikes-online/603778"
    },
    {
      "id": 59,
      "title": "Court orders Franklin Templeton to suspend e-Vote",
      "description": "Franklin Templeton created panic in MF markets in April when it announced of closing 6 funds which invested in lower-rated debt in return of higher yields. This effected $3bn of customers funds & they ask for approval before shutting these. The fund house purposed investor to e-vote on the decision whether it be managed by them or third party. But high court said that the vote could not go until an audit of the 6 funds is made public.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Logo_Ben_Head.jpg/800px-Logo_Ben_Head.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/mf/mf-news/franklin-templeton-mutual-fund-suspends-e-vote-on-winding-up-of-six-schemes/articleshow/76272003.cms",
      "fullArticleName": "economictimes"
    },
    {
      "id": 60,
      "title": "SOVEREIGN GOLD BOND SCHEME 2020-21 SERIES-3",
      "description": "The Sovereign Gold Bond Scheme (SGB) 2020-21 Series 3 is open for subscription for the period from June 08, 2020, to June 12, 2020. The minimum investment in SGB is one gram while the maximum is 4 kg of gold. And, the price has been set at Rs 4677 per gram of gold. However, for those applying online and making payment through digital mode, there is a discount of Rs 50 per gram, hence the price for them is set at Rs 4627. ",
      "imageUrl": "https://i2.pickpik.com/photos/203/660/898/gold-gold-is-money-business-money-preview.jpg",
      "type": "news",
      "fullArticleLink": "https://www.financialexpress.com/money/sovereign-gold-bond-scheme-sgb-2020-21-series-iii-opens-at-rs-4677-per-gram-should-you-invest/1984617/",
      "fullArticleName": "Financial Express"
    },
    {
      "id": 61,
      "title": "WHAT IS AN OFFER FOR SALE ?",
      "description": "An Offer for Sale(OFS) is a mechanism where promoters in a listed company sell their shares directly to the public in a transparent manner. This mechanism was first introduced in the market by SEBI in 2012.  In an OFS, promoters of a company dilute their stake by selling their shares on an exchange platform. Retail investors, companies, and Foreign Institutional Investors (FIIs) can bid on these shares at the floor price set.",
      "imageUrl": "https://cdn.pixabay.com/photo/2017/09/07/12/57/sale-2725059_1280.png",
      "type": "learn",
      "fullArticleLink": "https://www.edelweiss.in/investology/introduction-to-primary-market-79a025/what-is-ofs-offer-for-sale-3414d3",
      "fullArticleName": "Edelweiss"
    },
    {
      "id": 62,
      "title": "SBI LIFE INSURANCE OFS COMING",
      "description": "State Bank of India (SBI) proposed to sell a 2.10 percent stake in SBI Life, set a floor price of Rs 725 for the offer for sale (OFS), which stands at 2.24 percent discount to the closing price of Rs 741.25. The country’s biggest lender by assets is aiming to sell around 2.10 crore shares through OFS. The issue will open on June 12 for non-retail investors and on June 15 for retail investors.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/20/SBI_in_Huzurabad.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-sets-floor-price-of-rs-725-for-ofs-to-divest-2-1-stake-in-sbi-life-insurance/articleshow/76325803.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 63,
      "title": "Books to eliminate fear of stock market volatility",
      "description": "'Warren Buffett's Ground Rules,' by Jeremy C. Miller: curated from the compilation of letter sent by buffet on conservative investing. \"I Will Teach You To Be Rich\" talks about prioritizing spending, reducing debt & automate financing. Mastering The Market Cycle,' by Howard Marks: focuses on the cyclical nature of investing and markets. 'Unshakeable: Your Financial Freedom Playbook: deals to keep money solid through the ups and downs.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Books_HD_%288314929977%29.jpg",
      "type": "learn",
      "fullArticleLink": "https://www.businessinsider.in/stock-market/news/6-of-the-best-personal-finance-books-to-read-if-youre-freaking-out-about-the-stock-market/articleshow/74748076.cms",
      "fullArticleName": "businessinsider"
    },
    {
      "id": 64,
      "title": "Reliance Jio got 10 investment deals in 2 months",
      "description": "New investments to the bandwagon of investment in reliance Jio is by global alternative asset firm TPG which would invest Rs 4,546.80 crore and L Catterton Rs 1,894.50 crore at an enterprise value of Rs 5.16 lakh crore. Previous eight investment deals were by Facebook, Silver Lake, Vista Equity Partners, General Atlantic, KKR, Mubadala, ADIA, and TPG which since April 22 brought in Rs 104,326.95 crore.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/70/Jio_sim.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/news/10-deals-in-2-months-ril-says-tpg-l-catterton-will-invest-rs-6441-cr-in-jio-platforms/articleshow/76363719.cms",
      "fullArticleName": "economictimes"
    },
    {
      "id": 65,
      "title": "RBI decision can bring bad news for kotak bank ",
      "description": "RBI plans to limit the tenure of the CEO of Kotak Mahindra bank. RBI suggested that the tenure of promoter CEOs should be limited to 10 & Non-promoter for 15 years. Currently, Uday Kotak, is the promoter and CEO of the bank, has been in this position since inception. The stock price could show some volatility due to this. RBI reason behind this is his bad experience with promoters of other banks like Bank of Rajasthan, GTB & Yes Bank",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Kotak_Mahindra_Bank_ATM.JPG",
      "type": "news",
      "fullArticleLink": "https://www.livemint.com/industry/banking/rbi-s-plan-to-hit-kotak-mahindra-the-hardest-11591982061499.html",
      "fullArticleName": "livemint"
    },
    {
      "id": 66,
      "title": "TATA MOTORS DISCONTINUE JTP BRAND",
      "description": "Tata Motors will discontinue its Jayem Tata Performance(JTP) brand of performance cars due to reduced demand for such vehicles in the consequences of the Covid-19 pandemic. JT Special Vehicles (JTSV), a 50:50 joint venture between Jayem Automotives and Tata Motors, made high-performance versions of Tata Motors’ passenger cars. The venture had so far developed and marketed the Tiago JTP and Tigor JTP.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/33/Tiago_Test_Drive_Car_Bengaluru.jpg",
      "type": "news",
      "fullArticleLink": "https://www.cnbctv18.com/auto/tata-motors-to-discontinue-jtp-performance-cars-will-acquire-jayem-automotives-stake-in-jt-special-vehicles-6133101.htm",
      "fullArticleName": "Cnbctv18"
    }
  ]
}