{
  "News": [
    {
      "id": 0,
      "title": "LUPIN POSITIVE FACTS DURING A COVID-19 PANDEMIC",
      "description": " Lupin has received an Establishment Inspection Report (EIR) from the USFDA for its manufacturing plant in Nagpur, Aurangabad and Mandideep with no action indicated.  Lupin has launched generic Mycophenolic acid delayed-release tablets of 180 mg and 360 mg. It is used to prevent organ rejection in patients receiving kidney transplants in the US market. ",
      "imageUrl": "https://www.dsij.in/Portals/0/EasyDNNNews/12279/600600p10163EDNmainimg-img-Lupin.jpg"
    },
    {
      "id": 1,
      "title": "FMCG LEADER “HUL” INITIATIVES AGAINST CORONA VIRUS",
      "description": "HUL has committed Rs 100 crore to help in the fight against coronavirus. The company will also donate 2 crores pieces of Lifebuoy soaps and donate Rs 10 crore to upgrade the health care facilities in testing centers and hospitals. Hindustan Unilever has collaborated with UNICEF for a mass communication campaign to inform the public against the COVID-19 pandemic. ",
      "imageUrl": "https://res.cloudinary.com/people-matters/image/upload/fl_immutable_cache,w_624,h_351,q_auto,f_auto/v1543907601/1543907600.jpg"
    },
    {
      "id": 2,
      "title": "NATIONWIDE LOCK DOWN AFFECTS ON INVESTOR",
      "description": "Health insurance players will also get a new growth cover as individuals gradually shift health insurance to essential spending. The investor preferences are changing towards sectors like chemicals and pharmaceuticals. Demand cooldown for cooling appliances makers due to lockdown.  The lockdown impact will change investor behaviour towards fresh home purchases hitting the residential segment for some time. ",
      "imageUrl": "https://mmo.aiircdn.com/265/5e91e4ad6fd11.jpg"
    },
    {
      "id": 3,
      "title": "BRITANNIA INDUSTRIES POSITIVE FACTS",
      "description": "Britannia Industries could report double-digit growth in consolidated profit in the March quarter due to the lower tax rate. The company declared an interim dividend of Rs 35 per share for the FY-20. The dividend will be paid to the shareholders before May 23, 2020. Britannia has partnered with Dunzo for the home delivery of all its products. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/08/Britannia1-770x433.jpg"
    },
    {
      "id": 4,
      "title": "A DEAL BETWEEN BHARAT EARTH MOVERS LIMITED AND COAL INDIA LIMITED",
      "description": "Coal India signed two purchase pacts totaling nearly Rs 400 crore with state-owned heavy earthmoving machinery manufacturer BEML for buying seven 150-tonne dumpers and eight 190-tonne dumpers. Coal India plans to invest  Rs 7000 crore in acquiring 360-odd heavy mining machinery over the next three-four years to enhance production for achieving a billion tonnes production capacity by 2024.",
      "imageUrl": "https://images.assettype.com/freepressjournal%2F2020-04%2Ff00dd344-026c-4ac3-8bd6-8c321c71afb2%2Fdumper.jpg?rect=0%2C120%2C1280%2C720&format=webp&w=750&dpr=1.3"
    },
    {
      "id": 5,
      "title": "RELIANCE RIGHTS ISSUE UPDATE",
      "description": "Reliance Industries is considering issuing of shares to existing shareholders on a rights basis to reduce its massive debt pile. The proposed rights issue is the first from the company in 29 years.  Reliance Industries will announce its financial results for the March quarter on April 30. RIL also added that it will recommend dividend on equity shares. ",
      "imageUrl": "https://www.jagranimages.com/images/newimg/18102019/18_10_2019-ril_19678369.jpg"
    },
    {
      "id": 6,
      "title": "WHAT IS A RIGHTS ISSUE?",
      "description": "A rights issue is a way by which a listed company can raise additional capital. The company gives its existing shareholders the right to subscribe to newly issued shares in proportion to their existing holdings at a discounted price. For example, 1:4 rights issue means an existing investor can buy one extra share for every existing four shares.",
      "imageUrl": "http://im.rediff.com/getahead/2005/jun/22shares.gif"
    },
    {
      "id": 7,
      "title": "WHAT IS A PREFERENTIAL ISSUE?",
      "description": "A preferential issue is an issue of shares by listed companies to a select group of investors under Section 81 of the Companies Act, 1956. This is a faster way for a company to raise equity capital. A person holding preferential shares has the right to be paid from company assets before common stockholders if the company goes into bankruptcy.",
      "imageUrl": "https://d1whtlypfis84e.cloudfront.net/guides/wp-content/uploads/2018/03/25151322/DVR-shares-300x215.jpg"
    },
    {
      "id": 8,
      "title": "WHAT IS A FINANCIAL MARKET?",
      "description": "Financial markets are made by buying and selling numerous types of financial securities including equities, bonds, currencies, and derivatives. These are markets where businesses grow their cash, companies decrease risks, and investors make more cash.  It serves as an agent between the investors and collectors. Types of Financial Markets are capital, money, derivatives, and the forex market. ",
      "imageUrl": "http://www.thefinliteinstitute.com/wp-content/uploads/2018/07/12-1G2061409501W.jpg"
    },
    {
      "id": 9,
      "title": "MARUTI SUZUKI ZERO SALES IN APRIL",
      "description": "The country’s largest carmaker Maruti Suzuki reported zero sales in the domestic market last month with factories shut in action with government orders to prevent the check of the coronavirus pandemic. The carmaker suspended operations from March 22, in line with orders from the government. In FY20, automobile volumes declined and expect a double-digit drop in FY21 sales. ",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-09/09/full/1567971605-2977.jpg"
    },
    {
      "id": 10,
      "title": "RELIANCE INDUSTRIES FY20 Q4 EARNINGS",
      "description": "Reliance Industries (RIL) on April 30 reported an overall profit of Rs 6,348 crore for the March quarter. RIL's overall profit dropped 45.5 percent due to the fall in oil prices triggered by coronavirus but an impressive 72.7 percent sequential growth by Jio Platforms limited the decline. The company announced the terms of a rights issue of Rs 53,125 crore.",
      "imageUrl": "https://assets.vccircle.com/uploads/2019/03/reliance.jpg"
    },
    {
      "id": 11,
      "title": "AFTER 29 YEARS RELIANCE INDUSTRIES ANNOUNCED RIGHTS ISSUE",
      "description": "Reliance Industries (RIL) has announced fundraising of Rs 53,125 crore by way of a 1:15 rights issue. Means one share will be offered for every 15 shares. The board of directors will issue more than 41 crore equity shares at Rs 1,257 each which is 14.31 percent discount to Thursday’s closing price of Rs 1,467 on the BSE. ",
      "imageUrl": "https://images.livemint.com/img/2019/04/24/600x338/RIL_1556084550868.jpg"
    },
    {
      "id": 12,
      "title": "HINDUSTAN UNILEVER FY20 Q4 EARNINGS",
      "description": "FMCG major Hindustan Unilever's Q4FY20 profit declined by 1.2 percent year-on-year to Rs 1,519 crore and revenue fell 9.4 percent YoY to Rs 9,011 crore due to decline in volumes after the lockdown in the second half of March. The company has dropped the prices of hand sanitizers and hand wash by 50 percent and 15 percent respectively. ",
      "imageUrl": "https://www.hul.co.in/Images/India-LUX-new-hand-wash-collection-310818_tcm1255-525690_w400.jpg"
    },
    {
      "id": 13,
      "title": "TECH MAHINDRA FY20 Q4 EARNINGS",
      "description": "Software services firm Tech Mahindra is posted a 29 percent year-on-year (YoY) fall in consolidated net profit at Rs 803.90 crore for the quarter ended March. The company’s revenue in the March quarter rose 6.72 percent to Rs 9,490 crore. The board declared a final dividend of Rs 5 per share and the interim dividend of Rs 10 per share.\n\n\n\n\n\n",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-11/05/full/1572969642-527.jpg"
    },
    {
      "id": 14,
      "title": "NPAs OF BANK OF BARODA RISE 6 TIMES IN 6 YEARS",
      "description": "Non-performing assets of Bank of Baroda (BoB) rose from Rs 11,876 crore at March-end 2014 to Rs 73,140 crore at December-end 2019.  The number of NPA accounts rose from 2,08,035 as of March 31, 2014, to 6,17,306 as of December 2019. Bank of Baroda collected Rs 107.7 crore through the SMS alert fee in the last 2 years. ",
      "imageUrl": "https://images.livemint.com/img/2019/08/26/600x338/BankofBaroda_1554006973769_1566817622477.jpg"
    },
    {
      "id": 15,
      "title": "ASIAN PAINTS MAKE HAND SANITIZERS  ",
      "description": "India’s largest decorative paint maker Asian Paints announced that it will start making hand and surface sanitizers under the Viroprotek brand and it will be available in the market from next week. The sanitizer is being manufactured at the Asian Paints plant in Ankleshwar, Gujarat and the company has obtained all necessary permissions from authorities. \n",
      "imageUrl": "https://img.etimg.com/thumb/msid-53560228,width-300,imgsize-164553,resizemode-4/asian-paints-to-enhance-manufacturing-capacity.jpg"
    },
    {
      "id": 16,
      "title": "BAJAJ AUTO ZERO SALES IN APRIL",
      "description": "Bajaj Auto did not sell any two-wheelers or commercial vehicles in the domestic market in April. The company shipped 32,009 two-wheeler units to overseas markets last month. The company managed to export 5,869 commercial vehicle units in the last month. Bajaj Auto sold a total of 37,878 units last month, down 91 percent from 4,23,315 units in April 2019.\n\n\n\n",
      "imageUrl": "https://www.bajajauto.com/intracityvehicles/img/banner1.jpg"
    },
    {
      "id": 17,
      "title": "ASIAN PAINTS PARTIALLY RESUMES OPERATIONS",
      "description": "Asian Paints has partially resumed operations at some of its manufacturing locations, warehouses, and offices where lockdown restrictions have been eased. The operations at these locations will be carried out in accordance with the guidelines issued by the regulatory authorities. The company had disruption of operations across the country on account of the COVID -19 pandemic. \n",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/04/Paints-e1548221251733-770x433.jpg"
    },
    {
      "id": 18,
      "title": "TCS LAUNCHES ARTIFICIAL INTELLIGENCE (AI) POWERED CLOUD BASED SOLUTION",
      "description": "Tata Consultancy Services launch an AI-powered, cloud-based solution to detect wafer abnormal in semiconductor manufacturing. TCS WaferWise automatically detects defects, improves product quality, and enhances business growth. The solution harnesses the company's contextual knowledge of the semiconductor industry and the power of deep learning technology, to help chipmakers digitally re-imagine their product quality assurance process. \n\n\n\n",
      "imageUrl": "https://www.domain-b.com/companies/companies_t/tcs/images/TCS-Hangzhou-Software-Park-23-apr.jpg"
    },
    {
      "id": 19,
      "title": "FORD INDIA LAUNCHES CONTACTLESS SALES SERVICE",
      "description": "Ford India announced the launch of contactless sales and service of vehicles as its dealerships on maintaining social distancing norms in the wake of coronavirus pandemic. The new procedure called \"Dial-A-Ford\" will allow a prospective customer to book, test drive, or even get the delivery of the new vehicle at his or her doorstep. \n\n\n\n\n\n\n\n",
      "imageUrl": "https://cdn.autoportal.com/img/news/14739/main/5a46164e40c27ad321c6071f5946fd81/main_cropped.jpg"
    },
    {
      "id": 20,
      "title": "THREE IPOs POSTPONES DUE TO COVID-19 PANDEMIC",
      "description": "Equitas Small Finance Bank on March 18 will postpone the launch of its initial public offering due to coronavirus-led weak market conditions. The issue consisted of a fresh issue of Rs 550 crore and an offer for sale of 8 crore shares.  Burger King and Rossari Biotech were also postponed their IPOs scheduled to open on March 18. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/03/Initial_public_offering_ipo_bank_1280x720-770x433.jpg"
    },
    {
      "id": 21,
      "title": "MARUTI SUZUKI RESUME PRODUCTION AT MANESAR FROM MAY 12",
      "description": "Country's largest carmaker Maruti Suzuki will resume production of vehicles at Manesar facility from May 12. \"All activities would be carried out strictly per the Government regulations and guidelines. The process ensures the highest level of hygiene and sanitization across all its showrooms for the safety of its customers and employees. ",
      "imageUrl": "https://www.dsij.in/Portals/0/EasyDNNNews/11202/600600p10163EDNmainimg-MarutiSuzuki.jpg"
    },
    {
      "id": 22,
      "title": "RELIANCE INDUSTRIES CONSIDERS SALE OF ASIAN PAINTS STAKE",
      "description": "Reliance Industries is considering selling its stake in India’s largest paint maker valued at about $989 million to trim its debt. Mukesh Ambani Asia’s richest person, is in discussions with banks for a potential sale of its 4.9 percent stake in Asian Paints. Reliance could decide not to proceed with a deal. \n\n\n\n\n\n\n\n",
      "imageUrl": "https://content.indiainfoline.com/_media/iifl/img/misc/2015-02/23/full/reliance-industries-1424684108-8302300.jpg"
    },
    {
      "id": 23,
      "title": "TRADING CALL ON HINDUSTAN UNILEVER (HUL) STOCK",
      "description": "The HUL stock chart shows a downtrend for last 1 month. Its trend will become downtrend to uptrend after crossing a price of 2460. Try to buy a stock at 2461 with a target of 2635. Put a stop loss of 2283. Time Horizon of a trade is 10-20 days. HUL share current market price is 2078. ",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1580479103_fi9VzX_1664314_image_1521484347.jpg"
    },
    {
      "id": 24,
      "title": "TRADING CALL ON A TCS STOCK",
      "description": "The TCS stock chart shows an uptrend for the last 1 month. Its trend will become uptrend to downtrend after crossing a price of 1858. Try to short sell a stock in 1857 with a target of 1683. Put a stop loss of 1977. Time Horizon of a trade is 10-15 days. TCS share current market price is 1897.",
      "imageUrl": "https://www.businessinsider.in/thumb/msid-70146460,width-600,resizemode-4,imgsize-1808277/business/tcs-plans-to-hire-18000-freshers-in-next-3-months/tcs.jpg"
    },
    {
      "id": 25,
      "title": "HERO MOTOCORP SALE 10,000 TWO-WHEELERS",
      "description": "The country’s largest two-wheeler manufacturer Hero MotoCorp has sold 10,000 motorcycles and scooters since re-opening customer touchpoints last week. It reopened three of its manufacturing plants at Dharuhera and Gurgaon in Haryana and Haridwar in Uttarakhand. Hero MotoCorp has also conducted intense training programs though webinars reaching 700 internal sales, after-sales employees, and over 7000 customer touch-points.",
      "imageUrl": "https://images.financialexpress.com/2019/09/1-349.jpg"
    },
    {
      "id": 26,
      "title": "SOVEREIGN GOLD BOND SCHEME 2020-21 SERIES-2 FOR INVESTORS",
      "description": "The Sovereign Gold Bond Scheme 2020-21-Series-2 will be opened for subscription for the period from May 11, 2020, to May 15, 2020.  The issue price of Gold Bond is ₹4,540 per gram of gold after getting a discount of ₹50 per gram on the nominal value of ₹4,590 from Reserve Bank of India to those investors applying online.",
      "imageUrl": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/ef7xroru4aatfwb_660_070120125508_110520124451.jpg"
    },
    {
      "id": 27,
      "title": "TRADING CALL ON A KOTAK BANK STOCK",
      "description": "The KOTAK stock chart shows a downtrend for the last 2 months and 15 days. Its trend will become down to up after crossing a price of 1302. Try to buy a stock at 1303 with a target of 1491. Put a stop loss of 1252. Time Horizon of a trade is 30-40 days. KOTAK current market price is 1191.",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1469729425_YucbAp_kotak.jpg"
    },
    {
      "id": 28,
      "title": "TRADING CALL ON A L&T FINANCE STOCK",
      "description": "The L&T FINANCE stock chart shows a downtrend for the last 2 months. Its trend will become down to up after crossing a price of 70. Try to buy a stock at 71 with a target of 95. Put a stop loss of 49. Time Horizon of a trade is 30-40 days. L&T FINANCE share current market price is 62.",
      "imageUrl": "https://media.glassdoor.com/l/4b/96/e9/fd/ltfs-ho-3.jpg"
    },
    {
      "id": 29,
      "title": "FACTS OF SOVEREIGN GOLD BOND SCHEME 2020",
      "description": "1) Get a 2.5% interest annually in this scheme. But the interest is taxable. \n2) Its lock-in period is 8 years. But no long term capital gain charged after the 8 years.\n3) It has an exit plan after the 5 years. But long term capital gain is applicable. \n4) This scheme is risk-free.\n5) No making and GST charges on it.",
      "imageUrl": "https://i10.dainikbhaskar.com/thumbnails/813x548/web2images/www.bhaskar.com/2020/05/11/25_1589171500.jpg"
    }
  ]
}