{
  "News": [
    {
      "id": 0,
      "title": "Lupin positive facts during a covid-19 pandemic",
      "description": " Lupin has received an Establishment Inspection Report (EIR) from the USFDA for its manufacturing plant in Nagpur, Aurangabad and Mandideep with no action indicated.  Lupin has launched generic Mycophenolic acid delayed-release tablets of 180 mg and 360 mg. It is used to prevent organ rejection in patients receiving kidney transplants in the US market. ",
      "imageUrl": "https://www.dsij.in/Portals/0/EasyDNNNews/12279/600600p10163EDNmainimg-img-Lupin.jpg"
    },
    {
      "id": 1,
      "title": "FMCG leader “HUL” initiatives against corona virus",
      "description": "HUL has committed Rs 100 crore to help in the fight against coronavirus. The company will also donate 2 crores pieces of Lifebuoy soaps and donate Rs 10 crore to upgrade the health care facilities in testing centers and hospitals. Hindustan Unilever has collaborated with UNICEF for a mass communication campaign to inform the public against the COVID-19 pandemic. ",
      "imageUrl": "https://res.cloudinary.com/people-matters/image/upload/fl_immutable_cache,w_624,h_351,q_auto,f_auto/v1543907601/1543907600.jpg"
    },
    {
      "id": 2,
      "title": "Nationwide lock down affects on investor",
      "description": "Health insurance players will also get a new growth cover as individuals gradually shift health insurance to essential spending. The investor preferences are changing towards sectors like chemicals and pharmaceuticals. Demand cooldown for cooling appliances makers due to lockdown.  The lockdown impact will change investor behaviour towards fresh home purchases hitting the residential segment for some time. ",
      "imageUrl": "https://mmo.aiircdn.com/265/5e91e4ad6fd11.jpg"
    },
    {
      "id": 3,
      "title": "Britannia industries positive facts",
      "description": "Britannia Industries could report double-digit growth in consolidated profit in the March quarter due to the lower tax rate. The company declared an interim dividend of Rs 35 per share for the FY-20. The dividend will be paid to the shareholders before May 23, 2020. Britannia has partnered with Dunzo for the home delivery of all its products. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/08/Britannia1-770x433.jpg"
    },
    {
      "id": 4,
      "title": "A deal between bharat earth movers limited and coal india limited",
      "description": "Coal India signed two purchase pacts totaling nearly Rs 400 crore with state-owned heavy earthmoving machinery manufacturer BEML for buying seven 150-tonne dumpers and eight 190-tonne dumpers. Coal India plans to invest  Rs 7000 crore in acquiring 360-odd heavy mining machinery over the next three-four years to enhance production for achieving a billion tonnes production capacity by 2024.",
      "imageUrl": "https://images.assettype.com/freepressjournal%2F2020-04%2Ff00dd344-026c-4ac3-8bd6-8c321c71afb2%2Fdumper.jpg?rect=0%2C120%2C1280%2C720&format=webp&w=750&dpr=1.3"
    },
    {
      "id": 5,
      "title": "Reliance rights issue update",
      "description": "Reliance Industries is considering issuing of shares to existing shareholders on a rights basis to reduce its massive debt pile. The proposed rights issue is the first from the company in 29 years.  Reliance Industries will announce its financial results for the March quarter on April 30. RIL also added that it will recommend dividend on equity shares. ",
      "imageUrl": "https://www.jagranimages.com/images/newimg/18102019/18_10_2019-ril_19678369.jpg"
    },
    {
      "id": 6,
      "title": "What is a rights issue?",
      "description": "A rights issue is a way by which a listed company can raise additional capital. The company gives its existing shareholders the right to subscribe to newly issued shares in proportion to their existing holdings at a discounted price. For example, 1:4 rights issue means an existing investor can buy one extra share for every existing four shares.",
      "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcTiQsfQEUFB5-kQpJzO99k952MkwaUzQZWnZ5NqLXX-TSwrDmtV&usqp=CAU"
    },
    {
      "id": 7,
      "title": "What is a preferential issue?",
      "description": "A preferential issue is an issue of shares by listed companies to a select group of investors under Section 81 of the Companies Act, 1956. This is a faster way for a company to raise equity capital. A person holding preferential shares has the right to be paid from company assets before common stockholders if the company goes into bankruptcy.",
      "imageUrl": "https://d1whtlypfis84e.cloudfront.net/guides/wp-content/uploads/2018/03/25151322/DVR-shares-300x215.jpg"
    },
    {
      "id": 8,
      "title": "What is a financial market?",
      "description": "Financial markets are made by buying and selling numerous types of financial securities including equities, bonds, currencies, and derivatives. These are markets where businesses grow their cash, companies decrease risks, and investors make more cash.  It serves as an agent between the investors and collectors. Types of Financial Markets are capital, money, derivatives, and the forex market. ",
      "imageUrl": "https://live.staticflickr.com/977/41145436745_9cf8876bac_b.jpg"
    },
    {
      "id": 9,
      "title": "Maruti suzuki zero sales in april",
      "description": "The country’s largest carmaker Maruti Suzuki reported zero sales in the domestic market last month with factories shut in action with government orders to prevent the check of the coronavirus pandemic. The carmaker suspended operations from March 22, in line with orders from the government. In FY20, automobile volumes declined and expect a double-digit drop in FY21 sales. ",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-09/09/full/1567971605-2977.jpg"
    },
    {
      "id": 10,
      "title": "Reliance industries FY20 Q4 earnings",
      "description": "Reliance Industries (RIL) on April 30 reported an overall profit of Rs 6,348 crore for the March quarter. RIL's overall profit dropped 45.5 percent due to the fall in oil prices triggered by coronavirus but an impressive 72.7 percent sequential growth by Jio Platforms limited the decline. The company announced the terms of a rights issue of Rs 53,125 crore.",
      "imageUrl": "https://assets.vccircle.com/uploads/2019/03/reliance.jpg"
    },
    {
      "id": 11,
      "title": "After 29 years reliance industries announced rights issue",
      "description": "Reliance Industries (RIL) has announced fundraising of Rs 53,125 crore by way of a 1:15 rights issue. Means one share will be offered for every 15 shares. The board of directors will issue more than 41 crore equity shares at Rs 1,257 each which is 14.31 percent discount to Thursday’s closing price of Rs 1,467 on the BSE. ",
      "imageUrl": "https://images.livemint.com/img/2019/04/24/600x338/RIL_1556084550868.jpg"
    },
    {
      "id": 12,
      "title": "Hindustan unilever FY20 Q4 earnings",
      "description": "FMCG major Hindustan Unilever's Q4FY20 profit declined by 1.2 percent year-on-year to Rs 1,519 crore and revenue fell 9.4 percent YoY to Rs 9,011 crore due to decline in volumes after the lockdown in the second half of March. The company has dropped the prices of hand sanitizers and hand wash by 50 percent and 15 percent respectively. ",
      "imageUrl": "https://www.hul.co.in/Images/India-LUX-new-hand-wash-collection-310818_tcm1255-525690_w400.jpg"
    },
    {
      "id": 13,
      "title": "Tech mahindra FY20 Q4 earnings",
      "description": "Software services firm Tech Mahindra is posted a 29 percent year-on-year (YoY) fall in consolidated net profit at Rs 803.90 crore for the quarter ended March. The company’s revenue in the March quarter rose 6.72 percent to Rs 9,490 crore. The board declared a final dividend of Rs 5 per share and the interim dividend of Rs 10 per share.",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-11/05/full/1572969642-527.jpg"
    },
    {
      "id": 14,
      "title": "NPAs of bank of baroda rise 6 times in 6 years",
      "description": "Non-performing assets of Bank of Baroda (BoB) rose from Rs 11,876 crore at March-end 2014 to Rs 73,140 crore at December-end 2019.  The number of NPA accounts rose from 2,08,035 as of March 31, 2014, to 6,17,306 as of December 2019. Bank of Baroda collected Rs 107.7 crore through the SMS alert fee in the last 2 years. ",
      "imageUrl": "https://images.livemint.com/img/2019/08/26/600x338/BankofBaroda_1554006973769_1566817622477.jpg"
    },
    {
      "id": 15,
      "title": "Asian paints make hand sanitizers  ",
      "description": "India’s largest decorative paint maker Asian Paints announced that it will start making hand and surface sanitizers under the Viroprotek brand and it will be available in the market from next week. The sanitizer is being manufactured at the Asian Paints plant in Ankleshwar, Gujarat and the company has obtained all necessary permissions from authorities. ",
      "imageUrl": "https://img.etimg.com/thumb/msid-53560228,width-300,imgsize-164553,resizemode-4/asian-paints-to-enhance-manufacturing-capacity.jpg"
    },
    {
      "id": 16,
      "title": "Bajaj auto zero sales in april",
      "description": "Bajaj Auto did not sell any two-wheelers or commercial vehicles in the domestic market in April. The company shipped 32,009 two-wheeler units to overseas markets last month. The company managed to export 5,869 commercial vehicle units in the last month. Bajaj Auto sold a total of 37,878 units last month, down 91 percent from 4,23,315 units in April 2019.",
      "imageUrl": "https://www.bajajauto.com/intracityvehicles/img/banner1.jpg"
    },
    {
      "id": 17,
      "title": "Asian paints partially resumes operations",
      "description": "Asian Paints has partially resumed operations at some of its manufacturing locations, warehouses, and offices where lockdown restrictions have been eased. The operations at these locations will be carried out in accordance with the guidelines issued by the regulatory authorities. The company had disruption of operations across the country on account of the COVID -19 pandemic. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/04/Paints-e1548221251733-770x433.jpg"
    },
    {
      "id": 18,
      "title": "Tcs launches artificial intelligence (ai) powered cloud based solution",
      "description": "Tata Consultancy Services launch an AI-powered, cloud-based solution to detect wafer abnormal in semiconductor manufacturing. TCS WaferWise automatically detects defects, improves product quality, and enhances business growth. The solution harnesses the company's contextual knowledge of the semiconductor industry and the power of deep learning technology, to help chipmakers digitally re-imagine their product quality assurance process. ",
      "imageUrl": "https://www.domain-b.com/companies/companies_t/tcs/images/TCS-Hangzhou-Software-Park-23-apr.jpg"
    },
    {
      "id": 19,
      "title": "Ford india launches contactless sales service",
      "description": "Ford India announced the launch of contactless sales and service of vehicles as its dealerships on maintaining social distancing norms in the wake of coronavirus pandemic. The new procedure called \"Dial-A-Ford\" will allow a prospective customer to book, test drive, or even get the delivery of the new vehicle at his or her doorstep. ",
      "imageUrl": "https://cdn.autoportal.com/img/news/14739/main/5a46164e40c27ad321c6071f5946fd81/main_cropped.jpg"
    },
    {
      "id": 20,
      "title": "Three IPOs postpones due to covid-19 pandemic",
      "description": "Equitas Small Finance Bank on March 18 will postpone the launch of its initial public offering due to coronavirus-led weak market conditions. The issue consisted of a fresh issue of Rs 550 crore and an offer for sale of 8 crore shares.  Burger King and Rossari Biotech were also postponed their IPOs scheduled to open on March 18. ",
      "imageUrl": "https://static-news.moneycontrol.com/static-mcnews/2017/03/Initial_public_offering_ipo_bank_1280x720-770x433.jpg"
    },
    {
      "id": 21,
      "title": "Maruti suzuki resume production at manesar from may 12",
      "description": "Country's largest carmaker Maruti Suzuki will resume production of vehicles at Manesar facility from May 12. \"All activities would be carried out strictly per the Government regulations and guidelines. The process ensures the highest level of hygiene and sanitization across all its showrooms for the safety of its customers and employees. ",
      "imageUrl": "https://www.dsij.in/Portals/0/EasyDNNNews/11202/600600p10163EDNmainimg-MarutiSuzuki.jpg"
    },
    {
      "id": 22,
      "title": "Reliance industries considers sale of asian paints stake",
      "description": "Reliance Industries is considering selling its stake in India’s largest paint maker valued at about $989 million to trim its debt. Mukesh Ambani Asia’s richest person, is in discussions with banks for a potential sale of its 4.9 percent stake in Asian Paints. Reliance could decide not to proceed with a deal. ",
      "imageUrl": "https://content.indiainfoline.com/_media/iifl/img/misc/2015-02/23/full/reliance-industries-1424684108-8302300.jpg"
    },
    {
      "id": 23,
      "title": "Trading call on hindustan unilever (HUL) stock",
      "description": "The HUL stock chart shows a downtrend for last 1 month. Its trend will become downtrend to uptrend after crossing a price of 2460. Try to buy a stock at 2461 with a target of 2635. Put a stop loss of 2283. Time Horizon of a trade is 10-20 days. HUL share current market price is 2078. ",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1580479103_fi9VzX_1664314_image_1521484347.jpg"
    },
    {
      "id": 24,
      "title": "Trading call on a TCS stock",
      "description": "The TCS stock chart shows an uptrend for the last 1 month. Its trend will become uptrend to downtrend after crossing a price of 1858. Try to short sell a stock in 1857 with a target of 1683. Put a stop loss of 1977. Time Horizon of a trade is 10-15 days. TCS share current market price is 1897.",
      "imageUrl": "https://www.businessinsider.in/thumb/msid-70146460,width-600,resizemode-4,imgsize-1808277/business/tcs-plans-to-hire-18000-freshers-in-next-3-months/tcs.jpg"
    },
    {
      "id": 25,
      "title": "Hero motocorp sale 10,000 two-wheelers",
      "description": "The country’s largest two-wheeler manufacturer Hero MotoCorp has sold 10,000 motorcycles and scooters since re-opening customer touchpoints last week. It reopened three of its manufacturing plants at Dharuhera and Gurgaon in Haryana and Haridwar in Uttarakhand. Hero MotoCorp has also conducted intense training programs though webinars reaching 700 internal sales, after-sales employees, and over 7000 customer touch-points.",
      "imageUrl": "https://images.financialexpress.com/2019/09/1-349.jpg"
    },
    {
      "id": 26,
      "title": "Sovereign gold bond scheme 2020-21 series-2 for investors",
      "description": "The Sovereign Gold Bond Scheme 2020-21-Series-2 will be opened for subscription for the period from May 11, 2020, to May 15, 2020.  The issue price of Gold Bond is ₹4,540 per gram of gold after getting a discount of ₹50 per gram on the nominal value of ₹4,590 from Reserve Bank of India to those investors applying online.",
      "imageUrl": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/ef7xroru4aatfwb_660_070120125508_110520124451.jpg"
    },
    {
      "id": 27,
      "title": "Trading call on a kotak bank stock",
      "description": "The KOTAK stock chart shows a downtrend for the last 2 months and 15 days. Its trend will become down to up after crossing a price of 1302. Try to buy a stock at 1303 with a target of 1491. Put a stop loss of 1252. Time Horizon of a trade is 30-40 days. KOTAK current market price is 1191.",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1469729425_YucbAp_kotak.jpg"
    },
    {
      "id": 28,
      "title": "Trading call on a L&T finance stock",
      "description": "The L&T FINANCE stock chart shows a downtrend for the last 2 months. Its trend will become down to up after crossing a price of 70. Try to buy a stock at 71 with a target of 95. Put a stop loss of 49. Time Horizon of a trade is 30-40 days. L&T FINANCE share current market price is 62.",
      "imageUrl": "https://media.glassdoor.com/l/4b/96/e9/fd/ltfs-ho-3.jpg"
    },
    {
      "id": 29,
      "title": "Facts of sovereign gold bond scheme 2020",
      "description": "1) Get a 2.5% interest annually in this scheme. But the interest is taxable. \n2) Its lock-in period is 8 years. But no long term capital gain charged after the 8 years.\n3) It has an exit plan after the 5 years. But long term capital gain is applicable. \n4) This scheme is risk-free.\n5) No making and GST charges on it.",
      "imageUrl": "https://i10.dainikbhaskar.com/thumbnails/813x548/web2images/www.bhaskar.com/2020/05/11/25_1589171500.jpg",
      "type": "news"
    },
    {
      "id": 30,
      "title": "Trading call on a bata stock",
      "description": "The BATA stock chart shows a downtrend for the last 3 months and 10 days. Its trend will become down to up after crossing a price of 1405. Try to buy a stock at 1406 with a target of 1811. Put a stop loss of 1190. Time Horizon of a trade is 10-30 days. BATA share market price is 1349.",
      "imageUrl": "https://www.forummalls.in/wp-content/uploads/malls/Vijaya/new_bg/bata/fvm_bata_g2.jpg"
    },
    {
      "id": 31,
      "title": "General atlantic invest 6,598.38 crore in jio platforms",
      "description": "Private equity firm General Atlantic will invest Rs 6,598.38 crore in Jio Platforms at an equity value of Rs 4.91 lakh crore and an enterprise value of Rs 5.16 lakh crore. This will be the fourth investment in the Jio Platform following those of Facebook, Silver Lake, and Vista Equity Partners. General Atlantic’s will buy a 1.34% equity stake. ",
      "imageUrl": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_05_2020_12_35_23_9082047.jpg?width=920&format=webp"
    },
    {
      "id": 32,
      "title": "RIL rights issue open on may 20",
      "description": "Reliance Industries rights issue will open on May 20 and close on June 3 and offer partly paid-up shares to its existing shareholders. The company will raise up to Rs 53,036.13 crore of which Rs 39,755.08 crore used for paring debt. RIL is offering one share at Rs 1,257 to existing shareholders for every 15 held in the company. ",
      "imageUrl": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/ril_660_191119022942_090120020626_140520105020.jpg"
    },
    {
      "id": 33,
      "title": "Kotak mahindra bank allow video KYC",
      "description": "Kotak Mahindra Bank has introduced a video-KYC facility for customers opening savings accounts on Kotak 811 - the bank's digital banking platform. It is the first private Indian bank to offer a video-based \"zero-contact\" onboarding service. With Video KYC, verification of documents, signature are completed via a video call with a representative from the bank without any physical interface. ",
      "imageUrl": "https://images.financialexpress.com/2020/02/Video-KYC-small.jpg"
    },
    {
      "id": 34,
      "title": "Bajaj finance FY20 highlights",
      "description": "1) Bajaj Finance posted a 19.38 percent year-on-year (YoY) fall in net profit at Rs 948.10 crore for the Q4FY20.\n2) The company made provisions of Rs 1,954 crore in Q4FY20 against Rs 409 crore in Q4FY19.\n3) The company has lost 10 productive days in Q4FY20.\n4) New loans booked during the quarter increased by 3 percent YoY to Rs 60.3 lakh.",
      "imageUrl": "https://www.dynamiclevels.com/wp-content/uploads/2016/08/babaj-finance.jpg",
      "type": "news"
    },
    {
      "id": 35,
      "title": "Tata steel Q4FY20 results",
      "description": "Tata Steel reported a consolidated net profit of Rs 5.93 crore for the Q4FY20. The company had posted a consolidated net loss of Rs 212.41 crore in the last year. Tata Steel consolidated total income declined to Rs 4,288.87 crore, over Rs 5,547.71 crore in the last year. There is a financial risk for the company due to COVID-19.",
      "imageUrl": "https://www.hrkatha.com/wp-content/uploads/2017/12/2fa8710abe28570bdc2ae8034cc5a716.jpg"
    },
    {
      "id": 36,
      "title": "Colgate palmolive Q4FY20 results",
      "description": "Colgate-Palmolive posted a 3.32 percent year-on-year rise in net profit at Rs 204.15 crore for the Q4FY20. The company reported a 7.40 percent YoY drop in net sales at Rs 1,062.4 crore with an 8 percent YoY decline in volumes due to the ongoing Covid-19 situation. The company also declared a second interim dividend of Rs 16 per share. ",
      "imageUrl": "https://www.mbaskool.com/2017_images/stories/aug-images/mktgmx-colgatepalmolive.jpg"
    },
    {
      "id": 37,
      "title": "KKR invest 11,367 crore in jio platforms",
      "description": "Private equity firm KKR is set to invest Rs 11367 crore in Jio Platforms for a 2.32% stake. This will be the fifth investment in the Reliance Industries Ltd (RIL) business. With the latest deal, Jio Platforms will get a combined Rs78,562 crore from the five investments. KKR is an American global investment firm that manages multiple alternative asset classes.",
      "imageUrl": "https://www.gizbot.com/img/2020/05/xkkr-to-invest-rs-11367-crore-in-jio-platforms-for-2-32-stake1-1590130749.jpg.pagespeed.ic.tjgPvEsKLb.jpg"
    },
    {
      "id": 38,
      "title": "Second tranche of bharat bond ETF coming",
      "description": "Edelweiss Asset Management would launch the second tranche of Bharat Bond ETF in July with two new series to raise up to Rs 14,000 crore from the market. The two new series will have maturities of April 2025 and April 2031. Bond ETF invests in AAA-rated public sector companies including EXIM Bank, HPCL, HUDCO, NHAI, NHPC, NTPC, NABARD, and SIDBI.",
      "imageUrl": "https://www.basunivesh.com/wp-content/uploads/2019/12/Edelweiss-Bharat-Bond-ETF.jpg",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/bonds/second-tranche-of-bharat-bond-etf-coming-aims-to-raise-rs-14000-crore/articleshow/75886430.cms"
    },
    {
      "id": 39,
      "title": "Facts of bharat bond exchange traded fund",
      "description": "1) It has a fixed maturity date.\n2) It achieves to track the returns provided by the Nifty BHARAT Bond Index.\n3) This bond has no lock-in period.\n4) It provides relatively stable returns with lower taxes over the maturity period.\n5) The minimum and maximum investment amount is Rs.1000 and Rs 2,00,000 for the retail investors.\n6) Its managed at 0.0005% cost.",
      "imageUrl": "https://cdn.zeebiz.com/sites/default/files/styles/zeebiz_850x478/public/2020/01/08/108663-bharat-bond-etf-1.jpg?itok=00WPsONh&c=c5af8c0f92ccc8e249257bf0f1cb18e8",
      "type": "news"
    },
    {
      "id": 40,
      "title": "What is an etf?",
      "description": "An exchange-traded fund (ETF) is a basket of securities that trade on an exchange, just like a stock. ETF share prices fluctuate all day as the ETF is bought and sold; this is different from mutual funds that only trade once a day after the market closes. ETFs offer low managed costs and fewer broker commissions than buying the stocks.",
      "imageUrl": "https://images.financialexpress.com/2019/07/ETF-1.jpg",
      "type": "learn",
      "fullArticleLink": "https://www.investopedia.com/terms/e/etf.asp"
    },
    {
      "id": 41,
      "title": "HDFC LTD Q4FY20 results",
      "description": "HDFC LTD reported a 21.97 percent year-on-year (YoY) fall in net profit from Rs 2,862 crore which was reported in the Q4 of the last year. The mortgage lender has reported a profit of Rs 2,233 crore for the Q4FY20. Net interest income (NII) for the quarter rose 17 percent to Rs 3,780 crore compared with Rs 3,238 crore in the year-ago quarter. The HDFC board announced a dividend of Rs 21 per share for FY20. ",
      "imageUrl": "https://lh3.googleusercontent.com/8SuaM8yGXtFGgjkyMQUjHaFG5_w9rA7jFkvTFCA-re_tjH21WfF0TjdqOlMtWhaxLlayI8B1=w1080-h608-p-no-v0",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-q4-results-profit-drops-22-yoy-to-rs-2233-crore-firm-announces-dividend-of-rs-21-per-share/articleshow/75970203.cms"
    },
    {
      "id": 42,
      "title": "D-mart Q4FY20 results",
      "description": "Avenue Supermarts which owns and operates supermarket chain D-Mart, consolidated net profit for the Q4FY20 rose 41.6 percent to Rs 271.28 crore. Total revenue for the Q4FY20 stood at Rs 6,255.93 crore, up 23.6 percent from Rs 5,061.65 crore posted in the same period last year. Net profit margin improved to 4.3 percent. Its revenue in April was down by more than 45 percent as compared to the last year. ",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Dmart_tirupati.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/avenue-supermarts-q4-results-profit-jumps-42-yoy-to-rs-272-crore-revenue-rises-24/articleshow/75917933.cms"
    },
    {
      "id": 43,
      "title": "What is a net profit margin ?",
      "description": "The net profit margin is the ratio of net profit to revenue for a company that is multiplied by 100. Net profit is the gross profit minus operating expenses and all other expenses, such as taxes and interest paid on debt. Its formulas are Net Profit Margin= (NP/R)*100. Net profit(NP)=Gross Profit-OE-O-I-T, R=Revenue, OE=Operating expenses, O=Other expenses, I=Interest and T=Taxes.",
      "imageUrl": "https://publicdomainvectors.org/photos/profitcurve.png",
      "type": "learn",
      "fullArticleLink": "https://www.investopedia.com/ask/answers/021215/what-difference-between-gross-profit-margin-and-net-profit-margin.asp"
    },
    {
      "id": 44,
      "title": "Maruti partnership with icici bank",
      "description": "The country's largest carmaker Maruti Suzuki India (MSI) has joined hands with ICICI Bank to offer retail financing schemes to its customers. ICICI Bank is offering a Flexi EMI scheme which enables customers to pay low EMI initially, to help them overcome the liquidity stress due to the COVID-19 pandemic. The EMI amount starts from Rs 899 on a loan of Rs 1 lakh for the first three months.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Maruti_Suzuki_Dzire_VXi_VVT_%28front%29.JPG",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/auto-news/maruti-partners-icici-bank-to-offer-retail-financing-schemes-to-customers/articleshow/76002945.cms"
    },
    {
      "id": 45,
      "title": "JK tyre crosses 2 crore production",
      "description": "JK Tyre has crossed 2 crore units production milestone of trucks and bus radial (TBR) tires. The firm had recently launched 'Smart Tyre' technology, which monitors the tire's vital statistics, including pressure and temperature. The company had also launched the next generation of fuel-efficient 'Fuel Saver Technology' TBR tires that save up to 8 percent fuel in comparison to normal radial tires.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/30/JK_Tyre_Logo.png",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/tyres/jk-tyre-crosses-2-crore-units-production-milestone-of-trucks-bus-radial-tyres/articleshow/75996742.cms"
    },
    {
      "id": 46,
      "title": "Ceat Q4FY20 results",
      "description": "Tire maker Ceat reported a 19.58 percent decline in consolidated net profit at Rs 51.72 crore for the Q4FY20. The company had posted a net profit of Rs 64.32 crore in January-March quarter a year ago. Revenue from operations declined to Rs 6,778.83 crore in FY20 as compared with Rs 6,984.51 crore in 2018-19. The company has resumed operations at most of its factories with easing in lockdown restriction.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/CEAT_Logo.svg/1096px-CEAT_Logo.svg.png",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/ceat-q4-results-net-profit-falls-20-to-rs-52-crore/articleshow/76074508.cms"
    },
    {
      "id": 47,
      "title": "Sun pharma clinical trial on covid patients",
      "description": "Drugmaker Sun Pharmaceutical Industries Ltd has received Indian regulatory approval to start clinical trials of a pancreatitis drug in COVID-19 patients. Sun Pharma's pancreatitis drug, nafamostat mesylate, has been identified as a potential candidate for COVID-19 patients by scientists at the University of Tokyo and Leibniz Institute for Primate Research, Germany.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/26/Sun_Pharma_Logo.png",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indias-sun-pharma-to-conduct-clinical-trial-of-pancreatitis-drug-in-covid-19-patients/articleshow/76089435.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 48,
      "title": "India grid agreement with kalpataru power",
      "description": "India Grid Trust has signed an agreement to acquire a power transmission asset at Jhajjar in Haryana for Rs 310 crore from current owners Kalpataru Power Transmission and Techno Electric & Engineering Company. IndiGrid aims to scale up its power transmission assets under management (AUM) to Rs 30,000 crore by 2022 and has plans to diversify into the solar power sector. This will be the second acquisition by IndiGrid from a company.",
      "imageUrl": "https://p1.pxfuel.com/preview/392/422/405/sunset-electric-pylon-electric-tower-shimoga.jpg",
      "type": "news",
      "fullArticleName": "",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/energy/power/indigrid-to-buy-kalpataru-power-jv-asset-for-rs-310-crore/articleshow/76107797.cms"
    },
    {
      "id": 49,
      "title": "Imported products delisted at CAPF canteens",
      "description": "The Ministry of Home Affairs put on hold a list of non-Swadeshi products not to be sold at Central Armed Police Forces (CAPFs) canteens. The nationwide network of over 1700 CAPF canteens will only sell swadeshi products from June 1, 2020. The products manufactured by firms like Dabur, VIP industries, Eureka Forbes, HUL, Nestle India will not be sold at CAPF canteens anymore as they are prepared from purely imported products.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/70/Central_Police_Canteen%2C_Kollam.jpg",
      "type": "news",
      "fullArticleName": "Economic Times",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/over-1000-non-swadeshi-products-junked-from-capf-canteens/articleshow/76133733.cms"
    },
    {
      "id": 50,
      "title": "ICICI bank cuts interest rate",
      "description": "ICICI Bank has cut the interest rates on saving deposits by 25 basis points (bps). The private sector lender has cut the interest rates on all deposits of less than Rs 50 lakh to 3 percent, as against the existing 3.25 percent. Likewise, for deposits of Rs 50 lakh and above, the account holders will earn an interest of 3.50 percent, down from 3.75 percent currently.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/10/Icici-bandra_kurla_complex.jpg",
      "type": "news",
      "fullArticleName": "",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/banking/finance/banking/icici-bank-cuts-interest-rate-on-saving-deposits-by-25-bps/articleshow/76161027.cms"
    },
    {
      "id": 51,
      "title": "PNB cuts interest rate on savings account",
      "description": "Punjab National Bank announced to lower interest rate on savings account deposits by 0.50 percentage point, effective July 1. For deposits up to Rs 50 lakh, the new interest rate will be 3 percent, down by 0.50 percent from 3.50 percent. Deposits of Rs 50 lakh and above will earn an interest of 3.25 percent as against 3.75 percent currently. The trimming of interest rate is also on deposits of the SBI, Axis Bank and ICICI Bank.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0e/SBI_ATM_-_panoramio.jpg",
      "type": "news",
      "fullArticleName": "",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/banking/finance/banking/pnb-lowers-rates-on-savings-account-deposits-by-50-bps/articleshow/76183367.cms"
    },
    {
      "id": 52,
      "title": "Bharat biotech develop chikungunya vaccine",
      "description": "The Coalition for Epidemic Preparedness Innovations (CEPI) announced that it is partnering with vaccine maker Bharat Biotech to fund up to $14.1 million (around 106 crore) for the development of a Chikungunya vaccine. CEPI will fund the company for vaccine manufacturing and clinical development of a two-dose live-inactivated vaccine (BBV87) against Chikungunya. Bharat Biotech will further be supported with a grant of $2 million. ",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/58/Bharat_Biotech_Logo.jpg",
      "type": "news",
      "fullArticleName": "Moneycontrol.com",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/companies/bharat-biotech-secures-funding-from-cepi-for-developing-chikungunya-vaccine-5353911.html"
    },
    {
      "id": 53,
      "title": "Raghava life sciences developed covid drug",
      "description": "Active pharmaceutical ingredients manufacturer Raghava Life Sciences (RLS), which claims to have developed bulk drug Favipiravir that showed positive results in trials treating the novel Coronavirus disease. Favipiravir, a generic version of Avigan that is used to treat influenza in Japan, is being studied as an experimental drug in treating the novel Coronavirus disease in India, Russia, China, Japan, Turkey, Thailand, and others.",
      "imageUrl": "https://media.defense.gov/2020/Mar/09/2002265190/780/780/0/200309-D-HN545-003.JPG",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/hyderabad-s-raghav-life-sciences-develops-favipiravir-for-covid-19-patients-120060500792_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 54,
      "title": "US drug maker launch covid-19 drug",
      "description": "US drugmaker to launch its brand of Covid-19 experimental drug Remdesivir in the country in a July month. Gilead has licensed the drug to four companies i.e Cipla, Mylan, Hetero, and Jubilant Life Sciences for sale in India, but none of these firms have received approval from the drug controller. Most of the four companies are ready with their products and are awaiting a nod from the regulator to manufacture. ",
      "imageUrl": "https://media.defense.gov/2020/Apr/30/2002293722/780/780/0/200429-A-HZ730-1005.JPG",
      "type": "news",
      "fullArticleName": "Economic Times",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indian-licensees-free-to-price-remdesivir-gilead/articleshow/76185458.cms"
    },
    {
      "id": 55,
      "title": "Sun pharma phase 2 clinical trial",
      "description": "Sun Pharma initiates the Phase 2 clinical trial on AQCH, a phytopharmaceutical drug, as a potential treatment for COVID-19 patients. The clinical trial will be conducted across 12 centers in India in 210 patients. The treatment duration for patients will be 10 days. The results of the clinical trial are expected by October 2020. This is the first phytopharmaceutical drug approved\nfor clinical trials by the DCGI. ",
      "imageUrl": "https://cdn.pixabay.com/photo/2020/03/16/19/45/drug-4938120_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://www.ndtv.com/business/coronavirus-pandemic-news-sun-pharma-testing-plant-based-drug-aqch-as-potential-covid-19-treatment-2241164",
      "fullArticleName": "NDTV"
    },
    {
      "id": 56,
      "title": "Stocks to look for high gains",
      "description": "Castrol India (Rs 125) is fluctuating around its low & have slowly started regaining its pace. Further oil demand is likely to bounce back once industries open and vehicles start running on the road.\nReliance Industries (Price of  ₹1,571.8): Multiple investors like Silver Lake, Facebook & Abu Dhabi Investment Authority (ADIA) have invested in its Jio Platforms.  All these investment values Jio at an equity value of Rs 4.91 lakh crore. ",
      "imageUrl": "https://p1.pxfuel.com/preview/319/313/80/stocks-graph-abstract-accounting-analysis-banking-royalty-free-thumbnail.jpg",
      "type": "call"
    },
    {
      "id": 57,
      "title": "PVR experiencing huge losses due to covid-19",
      "description": "PVR Ltd reported a net loss of Rs 74.61 crore for the Q4. Due to the coronavirus outbreak in India, theatres had stopped operations since the second week of March which led to 0 collections. Further cinemas are in the last phase of unlocking and even dates of reopening will be decided after assessing the situation. Cinema business in  March have suffered losses of around Rs800 crore & many releases have delayed like Sooryavanshi, Radhe.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f5/PVR_Plaza_No_poster_for_Padmaavati.jpg",
      "type": "news",
      "fullArticleName": "moneycontrol.com",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/earnings/pvr-feels-lockdown-pain-slumps-to-q4-loss-of-rs-74-61-crore-5376301.html"
    },
    {
      "id": 58,
      "title": "Hero motocorp started selling there bikes online",
      "description": "In the current times of maintaining social distancing, Hero MotoCorp has started online eSHOP to buy & book two-wheeler from the home. Via eShop user can select the variant of 2 Wheeler colour, city, choose dealer & make payment. After doc verification, the vehicle would be delivered & there a representative will collect physical sign ( that is RTO mandate). Companies who had previously done the same are Harley-Davidson, Suzuki and KTM.",
      "imageUrl": "https://c.pxhere.com/photos/95/ef/photo-89751.jpg!d",
      "type": "news",
      "fullArticleName": "Time Now",
      "fullArticleLink": "https://www.timesnownews.com/auto/bike-news/article/hero-motocorp-eshop-now-buy-hero-scooters-and-bikes-online/603778"
    },
    {
      "id": 59,
      "title": "Court orders franklin templeton to suspend e-vote",
      "description": "Franklin Templeton created panic in MF markets in April when it announced of closing 6 funds which invested in lower-rated debt in return of higher yields. This effected $3bn of customers funds & they ask for approval before shutting these. The fund house purposed investor to e-vote on the decision whether it be managed by them or third party. But high court said that the vote could not go until an audit of the 6 funds is made public.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Logo_Ben_Head.jpg/800px-Logo_Ben_Head.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/mf/mf-news/franklin-templeton-mutual-fund-suspends-e-vote-on-winding-up-of-six-schemes/articleshow/76272003.cms",
      "fullArticleName": "economictimes"
    },
    {
      "id": 60,
      "title": "Sovereign gold bond scheme 2020-21 series-3",
      "description": "The Sovereign Gold Bond Scheme (SGB) 2020-21 Series 3 is open for subscription for the period from June 08, 2020, to June 12, 2020. The minimum investment in SGB is one gram while the maximum is 4 kg of gold. And, the price has been set at Rs 4677 per gram of gold. However, for those applying online and making payment through digital mode, there is a discount of Rs 50 per gram, hence the price for them is set at Rs 4627. ",
      "imageUrl": "https://i2.pickpik.com/photos/203/660/898/gold-gold-is-money-business-money-preview.jpg",
      "type": "news",
      "fullArticleLink": "https://www.financialexpress.com/money/sovereign-gold-bond-scheme-sgb-2020-21-series-iii-opens-at-rs-4677-per-gram-should-you-invest/1984617/",
      "fullArticleName": "Financial Express"
    },
    {
      "id": 61,
      "title": "What is an offer for sale ?",
      "description": "An Offer for Sale(OFS) is a mechanism where promoters in a listed company sell their shares directly to the public in a transparent manner. This mechanism was first introduced in the market by SEBI in 2012.  In an OFS, promoters of a company dilute their stake by selling their shares on an exchange platform. Retail investors, companies, and Foreign Institutional Investors (FIIs) can bid on these shares at the floor price set.",
      "imageUrl": "https://cdn.pixabay.com/photo/2017/09/07/12/57/sale-2725059_1280.png",
      "type": "learn",
      "fullArticleLink": "https://www.edelweiss.in/investology/introduction-to-primary-market-79a025/what-is-ofs-offer-for-sale-3414d3",
      "fullArticleName": "Edelweiss"
    },
    {
      "id": 62,
      "title": "SBI life insurance ofs coming",
      "description": "State Bank of India (SBI) proposed to sell a 2.10 percent stake in SBI Life, set a floor price of Rs 725 for the offer for sale (OFS), which stands at 2.24 percent discount to the closing price of Rs 741.25. The country’s biggest lender by assets is aiming to sell around 2.10 crore shares through OFS. The issue will open on June 12 for non-retail investors and on June 15 for retail investors.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/20/SBI_in_Huzurabad.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-sets-floor-price-of-rs-725-for-ofs-to-divest-2-1-stake-in-sbi-life-insurance/articleshow/76325803.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 63,
      "date": "Sun Jun 14 2020",
      "title": "Books to eliminate fear of stock market volatility",
      "description": "'Warren Buffett's Ground Rules,' by Jeremy C. Miller: curated from the compilation of letter sent by buffet on conservative investing. \"I Will Teach You To Be Rich\" talks about prioritizing spending, reducing debt & automate financing. Mastering The Market Cycle,' by Howard Marks: focuses on the cyclical nature of investing and markets. 'Unshakeable: Your Financial Freedom Playbook: deals to keep money solid through the ups and downs.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Books_HD_%288314929977%29.jpg",
      "type": "learn",
      "fullArticleLink": "https://www.businessinsider.in/stock-market/news/6-of-the-best-personal-finance-books-to-read-if-youre-freaking-out-about-the-stock-market/articleshow/74748076.cms",
      "fullArticleName": "businessinsider"
    },
    {
      "id": 64,
      "date": "Sun Jun 14 2020",
      "title": "Reliance jio got 10 investment deals in 2 months",
      "description": "New investments to the bandwagon of investment in reliance Jio is by global alternative asset firm TPG which would invest Rs 4,546.80 crore and L Catterton Rs 1,894.50 crore at an enterprise value of Rs 5.16 lakh crore. Previous eight investment deals were by Facebook, Silver Lake, Vista Equity Partners, General Atlantic, KKR, Mubadala, ADIA, and TPG which since April 22 brought in Rs 104,326.95 crore.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/70/Jio_sim.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/news/10-deals-in-2-months-ril-says-tpg-l-catterton-will-invest-rs-6441-cr-in-jio-platforms/articleshow/76363719.cms",
      "fullArticleName": "economictimes"
    },
    {
      "id": 65,
      "date": "Mon Jun 15 2020",
      "title": "RBI decision can bring bad news for kotak bank ",
      "description": "RBI plans to limit the tenure of the CEO of Kotak Mahindra bank. RBI suggested that the tenure of promoter CEOs should be limited to 10 & Non-promoter for 15 years. Currently, Uday Kotak, is the promoter and CEO of the bank, has been in this position since inception. The stock price could show some volatility due to this. RBI reason behind this is his bad experience with promoters of other banks like Bank of Rajasthan, GTB & Yes Bank",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Kotak_Mahindra_Bank_ATM.JPG",
      "type": "news",
      "fullArticleLink": "https://www.livemint.com/industry/banking/rbi-s-plan-to-hit-kotak-mahindra-the-hardest-11591982061499.html",
      "fullArticleName": "livemint"
    },
    {
      "id": 66,
      "date": "Tue Jun 16 2020",
      "title": "Tata motors discontinue JTP brand",
      "description": "Tata Motors will discontinue its Jayem Tata Performance(JTP) brand of performance cars due to reduced demand for such vehicles in the consequences of the Covid-19 pandemic. JT Special Vehicles (JTSV), a 50:50 joint venture between Jayem Automotives and Tata Motors, made high-performance versions of Tata Motors’ passenger cars. The venture had so far developed and marketed the Tiago JTP and Tigor JTP.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/33/Tiago_Test_Drive_Car_Bengaluru.jpg",
      "type": "news",
      "fullArticleLink": "https://www.cnbctv18.com/auto/tata-motors-to-discontinue-jtp-performance-cars-will-acquire-jayem-automotives-stake-in-jt-special-vehicles-6133101.htm",
      "fullArticleName": "Cnbctv18"
    },
    {
      "id": 67,
      "date": "Tue Jun 16 2020",
      "title": "Indiabulls housing finance raises 200 crore ",
      "description": "Indiabulls Housing Finance has raised Rs 200 crore by issuing securities to two large public sector banks on a private placement basis. The company has allotted 2,000 secured, redeemable, non-convertible debentures (NCDs) of face value Rs 10 lakh each aggregating to Rs 200 crore. The NCDs with 546 days maturity carry a coupon of 9 percent per annum payable annually.",
      "imageUrl": "https://p1.pxfuel.com/preview/394/842/338/rupee-indian-india-money-bank-note-bill.jpg",
      "type": "news",
      "fullArticleLink": "https://www.zeebiz.com/companies/news-indiabulls-housing-finance-raises-rs-200-cr-from-2-public-lenders-128979",
      "fullArticleName": "Zeebiz"
    },
    {
      "id": 68,
      "date": "Tue Jun 16 2020",
      "title": "Hamdard launched RoohAfza Fusion",
      "description": "Hamdard Laboratories India enters into the ready-to-drink segment with the launch of fruit juice flavors and milkshake under its popular RoohAfza brand. The company has launched RoohAfza Fusion with real fruit juices in five flavors of litchi, lemon, orange, pineapple, and mango in a convenient ready to drink, Tetrapak format for the Indian market.\n",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/29/Milk_Roohafza.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/roohafza-fusion-hamdard-laboratories-india-enters-ready-to-drink-segment/articleshow/76401692.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 69,
      "date": "Wed Jun 17 2020",
      "title": "HDFC AMC ofs opened today",
      "description": "Promoter entity Standard Life Investments will sell a 5.64 percent stake in HDFC Asset Management Company (AMC) via an offer for sale (OFS). \"Standard Life Investments proposes to sell up to 60,00,000 equity shares. The floor price for the sale has been fixed as Rs 2,362 per share. Non-retail investors can participate in the issue on June 17. On June 18, the issue will remain open for non-retail as well as retail investors.",
      "imageUrl": "https://cdn.pixabay.com/photo/2019/10/23/15/35/sale-4571926_960_720.png",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/markets/standard-life-investments-to-offload-5-64-stake-in-hdfc-amc-via-ofs-5412581.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 70,
      "date": "Wed Jun 17 2020",
      "title": "Ashok Leyland plans to raise 200 crore.",
      "description": "Hinduja group company Ashok Leyland board will meet later this week to discuss a plan to raise Rs 200 crore via NCDs. A meeting of the fundraising committee of the board is proposed to be held on June 19 to consider and issue secured, rated, listed, redeemable nonconvertible debentures (NCDs) aggregating to Rs 200 crore on a private placement basis, in one or more tranches.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/82/Ashok_Leyland_Ecomet_912.jpg",
      "type": "news",
      "fullArticleLink": "https://www.livemint.com/companies/news/ashok-leyland-plans-to-raise-rs-200-crore-via-ncds-11592329067328.html",
      "fullArticleName": "Livemint"
    },
    {
      "id": 71,
      "date": "Thu Jun 18 2020",
      "title": "Pidilite Industries FY19-20 Q4 results",
      "description": "Pidilite Industries reported a 33.92 percent decline in its consolidated net profit to Rs 156.51 crore for the fourth quarter (Q4) of FY19-20. The company had posted a net profit of Rs 236.87 crore for the Q4 of FY18-19. Its revenue from operations declined to Rs 1,544.68 crore for the Q4 of the financial year (FY) 2019-20 as compared with Rs 1,639.28 crore in the same period of 2018-19.",
      "imageUrl": "https://c1.peakpx.com/wallpaper/986/339/647/adhesive-fix-glue-repair-wallpaper-preview.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/earnings/pidilite-industries-q4-results-reports-33-dip-in-net-profit/articleshow/76430598.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 72,
      "date": "Thu Jun 18 2020",
      "title": "Mahindra & Mahindra launched Supro Ambulance",
      "description": "Mahindra & Mahindra has launched the Supro ambulance in two variants, LX and ZX at Rs 6.94 lakh. The first batch of the Supro has been produced exclusively for the Maharashtra government to meet the ambulance requirements in their fight against Coronavirus. It is powered by a BS-VI compliant 909cc diesel engine that produces 47PS and 100 Newton Metre (Nm) of torque and is connected to a 5-speed manual gearbox.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a7/QAS-ambulance.png",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/technology/auto/mahindra-supro-ambulance-launched-at-rs-6-94-lakh-first-batch-manufactured-for-maharashtra-5422241.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 73,
      "date": "Fri Jun 19 2020",
      "title": "RIL becomes India's first $150 bn company",
      "description": "The oil-to-telecom powerful organization Reliance Industries (RIL) became the first Indian company to be valued at $150 billion. In rupee terms, it also became the first company to be valued at over Rs 11 lakh crore. RIL now net-debt free after raising Rs 1.69 lakh crore in less than two months. Shares of the company rallied to its all-time high of Rs 1,738.95 on June 19 from its panic low of Rs 867.82, record on March 23.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Reliance_Industries.jpg",
      "type": "news",
      "fullArticleLink": "https://indianexpress.com/article/business/companies/mukesh-ambani-reliance-industries-ril-net-debt-free-jio-platforms-rights-issue-6465968/",
      "fullArticleName": "Indian Express"
    },
    {
      "id": 74,
      "date": "Fri Jun 19 2020",
      "title": "Grant permission to sell Favipiravir Covid drug ",
      "description": "The Drug Controller General of India (DCGI) has granted permission to manufacture and sell Glenmark pharmaceuticals Favipiravir for Covid-19. The approval has been given under “restricted use” in mild to moderate cases of Covid-19 infection. Its every strip containing 34 tablets will come at an approximate MRP of Rs 3500. For the treatment, 122 tablets will be required for 14 days.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/77/Covid_19_vaccins.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/dcgi-grants-permission-to-manufacture-and-sell-glenmark-pharmaceuticals-favipiravir-for-covid-19/articleshow/76468590.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 75,
      "date": "Sat Jun 20 2020",
      "title": "Bajaj Auto launches split seat Pulsar 125",
      "description": "Bajaj Auto launches a split seat variant of Pulsar 125, priced at Rs 79,091. The new Pulsar 125 split seat is powered by 125cc BS6 DTS-i engine and comes with features such a 5-speed gearbox with a primary kick to enable the rider start the bike in any gear, clip-on handlebars on a 31mm front fork, a wide digital console with trip meter and an anti-skid braking system.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/27/Pulsar_ug3.JPG",
      "type": "news",
      "fullArticleLink": "https://www.carandbike.com/news/bajaj-pulsar-125-split-seat-variant-launched-in-india-priced-at-rs-79-091-2248231",
      "fullArticleName": "Car and bike"
    },
    {
      "id": 76,
      "date": "Sat Jun 20 2020",
      "title": "Punjab National Bank FY19-20 Q4 results",
      "description": "Punjab National Bank net loss reduced to Rs 697.20 crore for the Q4 of FY19-20. Its net loss reduced to Rs 4,749.64 crore in the same quarter of FY18-19. The asset quality of the lender improved with the percentage of gross non-performing assets (NPA) at 14.21 percent against 15.90 percent year on year (YoY). PNB made provisions of Rs 4,901.31 crore for bad loans which is 51.33 percent down from the last year. It results are good. ",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/19/Punjab_national_bank_in_South_Road_-_geograph.org.uk_-_1519911.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/earnings/punjab-national-bank-narrows-q4-loss-to-rs-697-crore-as-bad-loans-ease-5433521.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 77,
      "date": "Sun Jun 21 2020",
      "title": "Cipla launches remdesivir drug for COVID-19",
      "description": "Homegrown pharma major Cipla Ltd announced the launch of its generic version of remdesivir, which has been authorized for emergency use in the treatment of COVID-19 patients by the USFDA, under its brand name Cipremi. Remdesivir is the only USFDA approved Emergency Use Authorisation (EUA) treatment for adult and paediatric patients hospitalized with laboratory-confirmed COVID-19 infection.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/68/Generic_finasteride_tablets_cipla.jpg",
      "type": "news",
      "fullArticleName": "Economic Times",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/cipla-launches-generic-remdesivir-for-covid-19-patients/articleshow/76498277.cms"
    },
    {
      "id": 78,
      "date": "Sun Jun 21 2020",
      "title": "Dr Reddy's launches drug for prostate cancer",
      "description": "Pharma major Dr. Reddy's Laboratories has launched generic Abiraterone Acetate tablets, used for the treatment of prostate cancer, in the US market. The company has launched Abiraterone Acetate tablets in the strength of 250 mg, after the approval from the United States Food and Drug Administration (USFDA). The product is a generic version of Johnson & Johnson's Zytiga tablets.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Dr_reddys_logo_%281%29.jpg",
      "type": "news",
      "fullArticleName": "Business Standard",
      "fullArticleLink": "https://www.business-standard.com/article/companies/dr-reddy-s-launches-cancer-drug-abiraterone-acetate-in-us-market-120061900983_1.html"
    },
    {
      "id": 79,
      "date": "Mon Jun 22 2020",
      "title": "Alembic Pharma tentative approval for its tablets",
      "description": "Alembic Pharma has received tentative approval from the US health regulator for its generic version of Rivaroxaban tablets used in the treatment of embolism and deep vein thrombosis(DVT). The approval by the US Food & Drug Administration (USFDA) for the Rivaroxaban tablet is for multiple strengths of 10 mg, 15 mg, and 20 mg. The tablet is also used for the reduction of risk of stroke. The current stock price of Alembic Pharma is 934.50.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/62/Blausen_0290_DeepVeinThrombosis.png",
      "type": "news",
      "fullArticleLink": "https://www.expresspharma.in/latest-updates/alembic-pharma-gets-tentative-us-fda-nod-for-generic-rivaroxaban-tablets/",
      "fullArticleName": "Express Pharma"
    },
    {
      "id": 80,
      "date": "Mon Jun 22 2020",
      "title": "Biocon expand drugs business with DKSH company",
      "description": "Biocon has partnered with DKSH company to expand its generic drugs business. Biocon Pharma has signed an agreement with DKSH Business Unit Healthcare to sell and distribute seven generic medicines in Singapore and Thailand. These seven generic doses from various areas like diabetology, cardiology, oncology, and immunology will be sold under Biocon’s brand in these key Asian markets. The current stock price of Biocon Ltd is 387.70.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/13/Syngene.jpg",
      "type": "news",
      "fullArticleLink": "https://www.thehindubusinessline.com/companies/biocon-ties-up-with-dksh-for-distribution-of-seven-products-in-singapore-thailand/article31886745.ece",
      "fullArticleName": "Business Line"
    },
    {
      "id": 81,
      "date": "Mon Jun 22 2020",
      "title": "What is a Debenture ?",
      "description": "1) A debenture is a type of debt instrument with no collateral backing.\n2) It relies on the creditworthiness and reputation of the issuer for support.\n3) It usually has a term greater than 10 years.\n4) Corporations and governments frequently issue debentures to raise capital or funds.\n5) This debt instrument pays an interest rate and is repayable on a fixed date.\n6) Some debentures can convert to equity shares while others cannot.",
      "imageUrl": "https://www.thebluediamondgallery.com/hand-held-card/images/debenture-holders.jpg",
      "type": "learn",
      "fullArticleLink": "https://www.investopedia.com/terms/d/debenture.asp",
      "fullArticleName": "Investopedia"
    },
    {
      "id": 82,
      "date": "Tue Jun 23 2020",
      "title": "Kamdhenu Group resumes 60% operations",
      "description": "The Steel Bars manufacturer Kamdhenu Group has resumed 60 percent operations at its plants across the country. The company has manufacturing plants in states like Odisha, Gujarat, Karnataka, Telangana, Andhra Pradesh, Bihar, Goa, Rajasthan, Uttar Pradesh, Uttarakhand, Himachal Pradesh, Punjab, etc. The Gurugram-based company has also a presence in the power and paints segment. The current stock price of Kamdhenu Ltd is 79.",
      "imageUrl": "https://cdn.pixabay.com/photo/2016/10/12/08/45/steel-construction-1733848_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/kamdhenu-group-resumes-operations-across-all-plants-5438431.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 83,
      "date": "Tue Jun 23 2020",
      "title": "Eicher Motors sales volume reduced",
      "description": "Eicher Motors, the maker of Royal Enfield bikes, is expected to face a significant drop in sales volume as customers go to postpone spending amid pay cuts and job losses. Royal Enfield’s (RE) volumes have contracted for the past six quarters in a row. The total volume for FY19-20 fell by 15.6% to nearly seven lakh units. The current stock price of Eicher Motors Ltd is 17,911.15.",
      "imageUrl": "https://cdn.pixabay.com/photo/2017/11/23/04/08/royal-enfield-2972007_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/two-wheelers-three-wheelers/eicher-motors-expects-significant-drop-in-sales/articleshow/76507574.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 84,
      "date": "Wed Jun 24 2020",
      "title": "TCS deploys the DynaPORT solution for Adani Ports",
      "description": "IT services major Tata Consultancy Services (TCS) has deployed its terminal operating system 'TCS DynaPORT' at the Mundra CT4 terminal for Adani Ports and Special Economic Zone (APSEZ), India's largest private port operator and end-to-end logistics provider. APSEZ operates 11 ports and terminals that represent 24 percent of India's port capacity. The current stock price of TCS is 2,042.\n",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/dd/TCS_Gitabitan_-_DN_54-55_Sector_V_Salt_Lake_City_-_Kolkata_20170515121609.jpg",
      "type": "news",
      "fullArticleLink": "https://www.newindianexpress.com/business/2020/jun/23/tcs-deploys-digital-solution-remotely-to-help-adani-ports-transform-mundra-operations-2160389.html",
      "fullArticleName": "New Indian Express"
    },
    {
      "id": 85,
      "date": "Wed Jun 24 2020",
      "title": "Asian Paints FY19-20 Q4 results",
      "description": "Paints maker Asian Paints net profit decreased by 2.1 percent to Rs 461.89 crore in the Q4 of FY19-20 as compared to Rs 471.65 crores in the Q4 of FY18-19. The company’s revenue from operations decreased by 7.1 percent to Rs 4,635.59 crore from Rs 4,991.50 crore a year ago. Its profit before tax decreased by 5.7 percent to Rs 699.22 crore from Rs 741.35 crore. It results are not good. Asian Paints Ltd current stock price is 1,748.\n",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Multicolored_tempera_paints.jpg",
      "type": "news",
      "fullArticleLink": "https://www.bloombergquint.com/quarterly-earnings/what-analysts-have-to-say-about-asian-paints-q4-results",
      "fullArticleName": "Bloomberg Quint"
    },
    {
      "id": 86,
      "date": "Thu Jun 25 2020",
      "title": "HUL will stop using 'Fair' in its skincare brand",
      "description": "Hindustan Unilever (HUL) the country's biggest consumer products firm will rename its skincare brand \"Fair & Lovely\" and will stop using ‘Fair’ in the product due to an anti-racism protest. Last year, it had removed words such as white and light from its packaging. The product with the revised name will be available in the market in the next few months. The current stock price of Hindustan Unilever Ltd is 2,157.",
      "imageUrl": "https://p1.pxfuel.com/preview/801/227/629/cream-skin-cream-glass-flowers-dahlia-pink.jpg",
      "type": "news",
      "fullArticleLink": "https://timesofindia.indiatimes.com/business/india-business/hindustan-unilever-to-drop-fair-from-fair-lovely/articleshow/76620813.cms",
      "fullArticleName": "Times of India"
    },
    {
      "id": 87,
      "date": "Thu Jun 25 2020",
      "title": "PFC sanctions 1 lakh crore loans in FY19-20",
      "description": " Power Finance Corporation (PFC) sanctioned loans over Rs 1 lakh crore for power projects during the 2019-20 financial year (FY). Out of the Rs 1 lakh crore, it successfully payout Rs 68,000 crore loans during the last financial year. The company disbursed Rs 11,000 crore during the last week of March. Its non-performing assets (NPAs) reduced to 3.8 percent in 2019-20 from 4.55 percent in 2018-19. The current stock price of PFC is 90.",
      "imageUrl": "https://c1.wallpaperflare.com/preview/281/821/196/power-line-pylon-electricity.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/india/power-finance-corporation-sanctions-over-rs-1-lakh-crore-loans-for-power-projects-in-fy20-5458321.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 88,
      "date": "Fri Jun 26 2020",
      "title": "IHCL plans to launch \"Qmin\" mobile application",
      "description": "Tata group's Indian Hotels Company Ltd (IHCL), which owns the high-quality Taj Hotels, announced the launch of the \"Qmin\" mobile application on 25 July. It is an online food delivery platform. With the launch of \"Qmin\", the company will bring Taj to homes. The launch will cover the top ten markets in India including Delhi, Chennai, and Bengaluru in five weeks. The current stock price of IHCL is 81.80.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/73/Taj_Mahal_Palace_Hotel.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/services/hotels-/-restaurants/ihcl-forays-into-online-gourmet-food-delivery-with-qmin/articleshow/76625299.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 89,
      "date": "Fri Jun 26 2020",
      "title": "PNC Infratech wins Rs 1,412 crore project",
      "description": "PNC Infratech has won a Rs 1,412 crore highway project from the National Highways Authority of India (NHAI) in Uttar Pradesh. The company announces receipt of Letter of Award (LOA)  for an NHAI Project of 53.95 km long four-laning of Meerut-Nazibabad section of NH-34 in the state of Uttar Pradesh. The project under Bharatmala Pariyojna will be executed on hybrid payment mode. The current stock price of PNC Infratech Ltd is 139.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/31/4_lane_roads_network_highways_NH_53_and_NH_6_in_Chhattisgarh_India_2.jpg",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/markets/pnc-infratech-jumps-16-on-receipt-of-loa-for-ham-project-of-rs-1-412-cr-120062600243_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 90,
      "date": "Sat Jun 27 2020",
      "title": "Adani Transmission Kharghar-Vikhroli project ",
      "description": "Adani Transmission Ltd (ATL) has signed an agreement with the Maharashtra State Electricity Transmission Company for the execution of the Kharghar Vikhroli transmission project. The project comprises approximately 34 km of 400 kV and 220 kV transmission lines at Vikhroli in Mumbai. This project would enable additional power into the Mumbai and help in meeting the future demand of the city. The current stock price of ATL is 277.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Pylon_Sheung_Shui.jpg",
      "type": "news",
      "fullArticleLink": "https://www.outlookindia.com/newsscroll/adani-transmission-inks-pact-to-execute-kharghar-vikhroli-transmission-project/1878380",
      "fullArticleName": "Outlook India"
    },
    {
      "id": 91,
      "date": "Sat Jun 27 2020",
      "title": "JSW Steel reduce workforce due to Covid-19 cases",
      "description": "According to reports, about 509 Covid-19 cases have been reported from the Bellary district of Karnataka. Out of which 296 cases from the JSW Steel plant. The company is not allowing nearly 11,000 migrant labour coming from nearby villages to work at the 12 million tonne capacity steel plant. But, It will continue operations with the 17,000-18,000 workers at their four colonies and plant sites. The stock price of JSW Steel is 193.",
      "imageUrl": "https://cdn.pixabay.com/photo/2017/10/10/23/22/steel-2839316_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/covid-19-threat-forces-jsw-steel-to-reduce-workforce-at-karnataka-plant-120062601141_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 92,
      "date": "Sun Jun 28 2020",
      "title": "Bonlon Industries IPO coming on 30th June",
      "description": "1) The IPO opens on Jun 30, 2020, and closes on Jul 3, 2020. \n2) It is an SME Initial Public Offer (IPO) of 3,756,000 equity shares of the face value of ₹10 aggregating up to ₹10.52 Crores.\n3) The issue price of the IPO is ₹28 Per Share.\n4) The minimum quantity to apply is 4000 Shares per application.\n5) Bonlon Industries Ltd is engaged in manufacturing, trading, and marketing of copper rods and bars.\n6) It is a Fixed Price Issue.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/32/Copper_wire_rod_produced_by_LS_Cable_%26_System.jpg",
      "type": "news",
      "fullArticleLink": "https://www.chittorgarh.com/ipo/bonlon-industries-ipo/1048/",
      "fullArticleName": "Chittorgarh"
    },
    {
      "id": 93,
      "date": "Sun Jun 28 2020",
      "title": "Sumitomo Chemical India Ltd OFS opens on 29th June",
      "description": "Sumitomo Chemical Company, promoter of Sumitomo Chemical India Ltd proposes to sell up to 49.91 lakh shares, representing one percent of the total paid-up equity share capital of the company. The OFS will open for Retail Investors on 29th June 2020. The floor price for the sale has been fixed as ₹265. The current stock price of Sumitomo Chemical India Ltd is 290.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Sumitomo_Chemical.jpg",
      "type": "news",
      "fullArticleLink": "https://www.thehindubusinessline.com/markets/stock-markets/offer-for-sale-in-sumitomo-india/article31916758.ece#:~:text=The%20OFS%20has%20an%20option,%E2%82%B9309.5%20on%20the%20BSE",
      "fullArticleName": "Thehindu Businessline"
    },
    {
      "id": 94,
      "date": "Mon Jun 29 2020",
      "title": "Reliance postpones natural gas production in KG-D6",
      "description": "Reliance Industries Limited (RIL) has postponed the start of production in its eastern offshore Krishna Godavari (KG) D6 block to September/October due to a lockdown. The three deepwater projects in block KG- D6 are R-Cluster, Satellite Cluster, and MJ fields. The combined production of gas from these three fields is expected to be 30 million standard cubic meters per day (mmscmd) by FY2024. The current stock price of RIL is 1,723.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Deepwater_Horizon_oil_spill_-_static_kill.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/energy/oil-gas/reliance-pushes-back-kg-d6-production-to-september/october/articleshow/76670918.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 95,
      "date": "Mon Jun 29 2020",
      "title": "Coal India invest 15,700 crore in conveyor belts",
      "description": "Coal India Ltd will invest Rs 15,700 crore in conveyor belts to replace the road movement between mines and wagons. Coal will be loaded directly onto wagons with the help of a conveyor. In the first phase, it will upgrade infrastructure at 35 mines. This involved capital expenditure of about Rs 12,300 crore. Phase-2 includes 14 projects in which four subsidiaries will spend Rs 3,400 crore. The stock price of Coal India Ltd is 135.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/60/Coal_Mine.jpg",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/coal-india-ups-investment-to-rs-15-700-cr-to-boost-mechanised-transport-120062901400_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 96,
      "date": "Tue Jun 30 2020",
      "title": "Ruchi Soya stock increases 8,818% in 103 days",
      "description": "Ruchi Soya Industries Ltd is one of the largest manufacturers of edible oil in India. They have been acquired by Patanjali Ayurved in 2019. The company becomes one of the top 60 companies on Dalal Street in terms of market capitalization after the Baba Ramdev’s Patanjali Group buying in it. Its market value increase to Rs 44,600 crore from Rs 500 crore in just 103 days. The current share price of Ruchi Soya is 1,371.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/13/Devanagari_script_used_in_product_name.jpg",
      "type": "news",
      "fullArticleLink": "https://www.businesstoday.in/markets/company-stock/patanjali-subsidiary-ruchi-soya-share-gained-8819-2020-here-why/story/408151.html",
      "fullArticleName": "Business Today"
    },
    {
      "id": 97,
      "date": "Tue Jun 30 2020",
      "title": "TCS to announce FY20 Q1 results on 9th July",
      "description": "IT services major Tata Consultancy Services (TCS) Board of Directors will meet on July 9 to approve the financial results for the quarter one (Q1) of FY20. The company's board will also consider declaration of interim dividend to equity shareholders. The dividend shall be paid to only those shareholders whose names appear on the Register of Members of the company. The current stock price of TCS is 2085.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Butterfly_Head_Tower%2C_TCS%2C_SIPCOT.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/tcs-to-announce-q1-results-on-july-9-5486041.htm",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 98,
      "date": "Wed Jul 01 2020",
      "title": "M&M reports a 55% fall in total sales in June",
      "description": "Auto major Mahindra & Mahindra (M&M) reported a 55 percent fall in total sales from 42,547 units to 19,358 units in June 2020. Domestic sales dropped 53 percent to 18,505 units in June 2020 as against 39,471 units in June 2019. The commercial vehicle sales fall 36 percent to 10,417 units in June 2020 as against 16,394 units in the last year of June month. The current stock price of M&M is 502.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/32/Mahindra_XUV_500_W6_2013.jpg",
      "type": "news",
      "fullArticleLink": "https://www.livemint.com/companies/news/mahindra-records-55-fall-in-total-sales-at-19-358-units-in-june-11593597309946.html",
      "fullArticleName": "Livemint"
    },
    {
      "id": 99,
      "date": "Wed Jul 01 2020",
      "title": "Hero MotoCorp records 4.5 lakh units sales in June",
      "description": "Hero MotoCorp the world's largest two-wheeler manufacturer has made 4.5 lakh units of sales in June 2020. The company's records four times rise in a sale from 112,682 units in May 2020 to 450,744 units in June 2020 due to a large demand from rural and semi-urban markets. In June of last year, it sold 6.16 lakh two-wheelers. The current stock price of Hero Motocorp Ltd is 2,544.\n",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Hero_passion_pro_bike_2014-05-30_14-18.jpg",
      "type": "news",
      "fullArticleLink": "https://auto.hindustantimes.com/auto/two-wheelers/signs-of-recovery-hero-motocorp-sells-4-5-lakh-units-in-june-41593597293315.html",
      "fullArticleName": "htauto"
    },
    {
      "id": 100,
      "date": "Thu Jul 02 2020",
      "title": "Axis Bank to raise 15,000 crore through share sale",
      "description": "The country's third-largest private lender, Axis Bank Ltd will raise to ₹15,000 crore. The bank will raise the money through a qualified institutions placement (QIP) or issuance of equity shares or issuance of American depository receipts (ADRs). Some private equity players, including Carlyle, KKR, and Fidelity, have shown interest to buy Axis Bank shares in the proposed QIP. The current stock price of Axis Bank Ltd is 425.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/54/Axis_Bank%2C_Temple_Road%2C_Mysore.jpg",
      "type": "news",
      "fullArticleLink": "https://www.thehindubusinessline.com/money-and-banking/axis-bank-to-raise-15000-crore-as-capital/article31971186.ece",
      "fullArticleName": "Business Line"
    },
    {
      "id": 101,
      "date": "Thu Jul 02 2020",
      "title": "COVID-19 becomes culprit for the IPO market",
      "description": "The first six months of 2020 has been one of the worst periods for the Initial Public Offering (IPO) market since the first half of 2012. Many companies were scheduled to launch their IPOs after SBI Card, but COVID-19 punctured the sentiment on the market. Experts feel the trend may revive in the second half of the calendar year (CY) 2020 only if the market and economic activity regains.",
      "imageUrl": "https://cdn.pixabay.com/photo/2020/04/02/19/11/covid-19-4996393_1280.png",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/markets/ipo-market-sees-worst-h1-in-almost-a-decade-can-the-trend-continue-in-rest-of-2020-5494331.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 102,
      "date": "Fri Jul 03 2020",
      "title": "Bharat Biotech developed COVID-19 vaccine ",
      "description": "Bharat Biotech developed a coronavirus vaccine named COVAXIN. A Hyderabad-based company  Bharat Biotech has achieved this success in collaboration with the Indian Council of Medical Research (ICMR) and the National Institute of Virology, Pune. It has got the approval for human trials by the Drug Controller General of India (DCGI). The stock price of Bharat Immunologicals & Biologicals Corporation Ltd (BIBCL) is 16.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/58/Bharat_Biotech_Logo.jpg",
      "type": "news",
      "fullArticleLink": "https://www.financialexpress.com/lifestyle/health/covaxin-coronavirus-vaccine-covid19-vaccine-15-august-icmr-bharat-biotech/2011985/",
      "fullArticleName": "Financial Express"
    },
    {
      "id": 103,
      "date": "Fri Jul 03 2020",
      "title": "Cadila COVID-19 vaccine gets DCGI permission",
      "description": "Cadila Healthcare COVID-19 vaccine gets Drug Controller General of India's (DCGI's) permission to initiate Phase one and second human clinical trials in India. The vaccine was found a strong response in multiple animal species such as mice, rats, guinea pigs, and rabbits. The company has plans to initiate clinical trials in July 2020 across multiple sites in India in over 1000 subjects. The stock price of Cadila Healthcare Ltd is 365.",
      "imageUrl": "https://cdn.pixabay.com/photo/2016/07/24/21/01/thermometer-1539191_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://www.livemint.com/companies/news/cadila-health-shares-rise-after-its-covid-vaccine-gets-dcgi-nod-for-human-trials-11593768852156.html",
      "fullArticleName": "Livemint"
    },
    {
      "id": 104,
      "date": "Sat Jul 04 2020",
      "title": "Axis Bank to close its business in Britain",
      "description": "Private lender Axis Bank will wind up its business in the UK. The bank has initiated proceedings with the regulators in the UK to close down operations of Axis Bank UK Limited, a subsidiary of Axis Bank, and aims to wind up all operations by April 2021. Bank has adopted a clear objective to focus on the Indian banking market. The decision will not impact the financial position of the bank. The stock price of Axis Bank Ltd is 429.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/88/Axis_Bank_Branch_Bagha_Purana_at_Mudki_Road%2C_Bagha_Purana.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/banking/finance/banking/axis-bank-to-close-british-subsidiary-focus-on-indian-business/articleshow/76766077.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 105,
      "date": "Sat Jul 04 2020",
      "title": "Indiabulls Housing FY19-20 Q4 results",
      "description": "Indiabulls Housing Finance has reported a 37 percent decline in profit before tax for the Q4 of FY19-20. The company reported a pre-tax profit of Rs 789 crore in Q4 of FY19-20 against Rs 1,252 crore in the same period last year. Net profit declined 20.77 percent to Rs 693.53 crore, from Rs 875.39 crore. It results are not good. The stock price of Indiabulls Housing Finance Ltd is 228.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/13/Indiabulls_Park_in_Panvel_Navi_Mumbai_by_Indiabulls_Real_Estate_Dwello.jpg",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/indiabulls-housing-finance-reports-37-drop-in-standalone-q4-pre-tax-profit-120070400012_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 106,
      "date": "Sun Jul 05 2020",
      "title": "Sovereign gold bond 4th tranche opens on July 6",
      "description": "The fourth tranche of sovereign gold bond of financial year 2020 will open for subscription on July 6 and will close on July 10. The issue price has been fixed at ₹4,852 per gram. But, investors applying online and making payments through digital mode will get a discount of ₹50 per gram. So, the price for them will be ₹4,802 per gram of gold. The minimum investment allowed in the bond is one gram of gold. Its issuance date on July 14.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Gold-295936.jpg",
      "type": "news",
      "fullArticleLink": "https://www.ndtv.com/business/gold-bond-sgb-scheme-2020-21-gold-bonds-to-be-available-from-july-6-read-this-before-investing-2257440",
      "fullArticleName": "Ndtv"
    },
    {
      "id": 107,
      "date": "Mon Jul 06 2020",
      "title": " Key things to know about the Sovereign Gold Bond",
      "description": "1) It is issued by the Reserve Bank of India (RBI) on behalf of the government.\n2) The scheme was launched in 2015 to reduce the demand for physical gold.\n3) Its issue price is fixed based on the recent closing price of gold of 999 purity as published by the India Bullion and Jewellers Association Ltd. \n4) It offers an annual interest rate of 2.5% to investors.\n5) Its maturity period is eight years.\n6) Exit option after 5 years.",
      "imageUrl": "https://c1.wallpaperflare.com/preview/908/857/237/gold-bars-gold-shop-gold-is-money-money.jpg",
      "type": "learn",
      "fullArticleLink": "https://www.livemint.com/money/personal-finance/sovereign-gold-bonds-open-for-subscription-today-10-things-to-know-11593921277944.html",
      "fullArticleName": "Livemint"
    },
    {
      "id": 108,
      "date": "Mon Jul 06 2020",
      "title": "Cadila COVID-19 drug \"Desidustat\" gets approval",
      "description": "Cadila Healthcare Ltd has received approval from Mexico's regulatory authority Cofepris to test one of its lead research vaccine Desidustat in the management of COVID-19 patients. The company will conduct a study to evaluate the response and safety of Desidustat tablets. As a part of the study,100 mg tablets of Desidustat will be used for 14 days during the trial. The current stock price of Cadila is 363.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Cylmin_100mg_by_Tsuruhara.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/zydus-cadila-gets-approval-from-mexican-authority-to-test-covid-19-drug/articleshow/76807437.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 109,
      "date": "Wed Jul 08 2020",
      "title": "Cipla launches COVID drug \"Cipremi\" at lowest cost",
      "description": "Pharma major Cipla has launched its COVID drug Cipremi at Rs 4,000 per 100 mg bottle, which is among the lowest globally, and is looking to supply over 80,000 bottles within the first month. Cipremi has been approved by the Drug Controller General of India (DCGI) for restricted emergency use in the country. It is a generic version of remdesivir. The current stock price of Cipla Ltd is 634.",
      "imageUrl": "https://c1.wallpaperflare.com/preview/705/44/892/ampoules-vaccination-vaccine-medicine.jpg",
      "type": "news",
      "fullArticleLink": "https://timesofindia.indiatimes.com/business/india-business/cipla-launches-generic-version-of-remdesivir-in-india/articleshow/76858964.cms",
      "fullArticleName": "Times of India"
    },
    {
      "id": 110,
      "date": "Thu Jul 09 2020",
      "title": "Stocks to invest during coronavirus pandemic",
      "description": "1) Asian Paints Ltd- The best price to make a new position in it is 1400. Currently trading in 1717.\n2) Hindustan Unilever Ltd- The best price for new investment in it is 1965. Currently trading in 2176.\n3) Reliance Industries Limited- The best price to make a new position in it is 1428. Currently trading in 1824. \n4) ICICI Bank Ltd- The best price for new investment in it is 285. Currently trading in 370.\n",
      "imageUrl": "https://c1.wallpaperflare.com/preview/161/689/154/chart-trading-courses-analysis.jpg",
      "type": "call"
    },
    {
      "id": 111,
      "date": "Thu Jul 09 2020",
      "title": "DHFL done a fraud to PNB of Rs 3688 crore",
      "description": "India’s second-largest lender Punjab National Bank (PNB) declared its Rs 3688 crore exposure to bankrupt mortgage lender Dewan Housing Finance Limited (DHFL). A fraud of Rs 3688 crore is being reported by Bank to RBI in the accounts of DHFL. The bank has already made provisions amounting to Rs.1246.58 Crore. DHFL has accumulated debt of over Rs 85,000 crore. The current stock price of PNB is 37.15.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d4/PNB_Head_Office.jpg",
      "type": "news",
      "fullArticleLink": "https://www.news18.com/news/business/pnb-reports-fraud-of-rs-3688-58-crore-in-npa-account-of-dhfl-2709145.html",
      "fullArticleName": "News18"
    },
    {
      "id": 112,
      "date": "Sun Jul 12 2020",
      "title": "Punjab & Sind Bank reports fraud of 112 crore",
      "description": "Punjab & Sind Bank reported fraud of Rs 112.42 crore in two Nonperforming assets (NPA) accounts of Maha Associated Hotels and Edyar Zinc. Maha Associated Hotels Pvt Ltd account with outstanding dues of Rs 71.18 crore has been declared as fraud and reported to RBI. The NPA account of Edyar Zinc with outstanding dues of Rs 41.24 crore has been also declared as fraud and reported to RBI. The stock price of Punjab and Sind Bank is 14.10.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/82/ATM_%28Plahi_Sahib%29.jpg",
      "type": "news",
      "fullArticleLink": "https://www.indiatvnews.com/business/news-punjab-and-sindh-bank-fraud-633243",
      "fullArticleName": "Indiatv"
    },
    {
      "id": 113,
      "date": "Sun Jul 12 2020",
      "title": "Biocon COVID drug Itolizumab gets DCGI permission",
      "description": "Biocon drug Itolizumab has been approved by the Drugs Controller General of India (DCGI) for treating moderate to severe Covid-19 patients. Itolizumab Injection 5mL solution is for emergency use in India for the treatment of cytokine release syndrome (CRS) due to Covid-19. The drug was launched in India in 2013 for treating skin disease. The current stock price of Biocon Ltd is 414.",
      "imageUrl": "https://p1.pxfuel.com/preview/729/511/790/pill-medicine-drug-capsule.jpg",
      "type": "news",
      "fullArticleLink": "https://www.bloombergquint.com/business/biocon-drug-receives-dcgi-nod-for-use-in-moderate-to-severe-covid-19-patients",
      "fullArticleName": "Bloombergquint"
    },
    {
      "id": 114,
      "date": "Mon Jul 13 2020",
      "title": "Rossari Biotech IPO opens today",
      "description": "The Rossari Biotech IPO opens on Jul 13, 2020, and closes on Jul 15, 2020. It is a main-board IPO of 11,682,033 equity shares of the face value of ₹2 Per Equity Share. The mainboard IPO's are listed on stock exchanges like NSE and BSE. The issue price of the IPO is ₹423 to ₹425 Per Equity Share. The minimum order quantity is 35 Shares per application and the lot size is 35 Shares. Its allotment will be done on Jul 20, 2020.",
      "imageUrl": "https://c1.wallpaperflare.com/preview/100/10/335/lab-research-chemistry-test.jpg",
      "type": "news",
      "fullArticleLink": "https://www.ndtv.com/business/rossari-biotech-ipo-subscription-news-rossari-initial-public-offer-subscribed-over-4-on-day-1-2261730",
      "fullArticleName": "Ndtv"
    },
    {
      "id": 115,
      "date": "Mon Jul 13 2020",
      "title": "Things to know about the Rossari Biotech company",
      "description": "The company is among the largest manufacturers of textile specialty chemicals in India. It also manufactures acrylic polymers. The company offers three main product categories namely home, personal care, and performance chemicals. Rossari Biotech has a presence in 17 foreign countries including Vietnam, Bangladesh, and Mauritius. The company has two R&D facilities one in the Silvassa, Gujarat, and the second in Mumbai.",
      "imageUrl": "https://cdn.pixabay.com/photo/2015/10/27/15/24/laboratory-1009178_1280.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/ipos/fpos/rossari-biotech-ipo-things-you-must-know-about-specialty-chemical-company/articleshow/76907314.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 116,
      "date": "Tue Jul 14 2020",
      "title": "Yes Bank FPO opens on 15th July 2020",
      "description": "The Yes Bank Follow on Public Offer (FPO) opens on Jul 15, 2020, and closes on Jul 17, 2020. The bank plans to raise Rs 15,000 crore through the FPO.  The issue is priced at ₹12 to ₹13 per equity share. Its lot size is 1000 Shares and the minimum order quantity is 1000 Shares. Its allotment will be done on Jul 22, 2020, and the allotted shares will be credited to your Demat account by Jul 24, 2020. It's listing date is Jul 27, 2020.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Bank_lane.JPG",
      "type": "news",
      "fullArticleLink": "https://www.livemint.com/market/stock-market-news/yes-bank-fpo-8-things-to-know-11594629415728.html",
      "fullArticleName": "Livemint"
    },
    {
      "id": 117,
      "date": "Tue Jul 14 2020",
      "title": "Lupin employees test positive for COVID-19",
      "description": "Drugmaker Lupin has shut one of its manufacturing plants in Gujarat after at least 17 employees at the site tested positive for COVID-19. Employees who produce tuberculosis drugs have tested positive. The company has some 11 manufacturing plants at the Ankleshwar site in Gujarat state, which is spread out over 40 acres and has 984 employees. The current stock price of Lupin Limited is 872.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/87/Cell_tech_Pharmed_Co_01.jpg",
      "type": "news",
      "fullArticleLink": "https://www.ndtv.com/india-news/pharma-firm-lupin-shuts-drug-plant-in-gujarat-after-17-staff-test-positive-for-coronavirus-2262785",
      "fullArticleName": "Ndtv"
    },
    {
      "id": 118,
      "date": "Wed Jul 15 2020",
      "title": "Maruti Suzuki bring back its faulty car models",
      "description": "The country’s largest carmaker Maruti Suzuki brings back 1,34,885 units of WagonR and Baleno models to fix faulty fuel pumps. The recall exercise would affect WagonR manufactured between November 15th, 2018, and October 15th, 2019, and Baleno (Petrol) manufactured between January 8th, 2019, and November 4th, 2019. The faulty part will be replaced, free of cost. The current stock price of Maruti Suzuki India Ltd is 5809.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Maruti_Suzuki_-_WagonR_LXi_%28front%29.JPG",
      "type": "news",
      "fullArticleLink": "https://timesofindia.indiatimes.com/auto/news/1-35-lakh-maruti-suzuki-baleno-and-wagonr-recalled-over-faulty-fuel-pump/articleshow/76973302.cms",
      "fullArticleName": "Times of India"
    },
    {
      "id": 119,
      "date": "Fri Jul 17 2020",
      "title": "Analysis on DMART stock",
      "description": "DMART is promoted by Avenue Supermarts Ltd. (ASL). It is an Indian chain of hypermarkets in India founded by Radhakishan Damani in the year 2002. Damani is the second richest person in India after Mukesh Ambani. The DMART chart trend was up for 3 years and 2 months. But, Its chart trend is down from 1 month due to its poor FY20-21 Q1 results. The best prices to make a new position in it are 1913 & 1466. Currently trading in 1988.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/72/DMart_Photo.png",
      "type": "call"
    },
    {
      "id": 120,
      "date": "Sun Jul 19 2020",
      "title": "Analysis on Kotak Bank stock",
      "description": "Kotak Mahindra Bank is an Indian second-largest private sector bank headquartered in Mumbai. It has 1600 branches & 2519 ATMs. The Bank was founded by Uday Kotak in February 2003. The Kotak Bank chart trend was up for 10 years from 25/1/2010 to 17/2/2020. But, for the last 5 months, its chart trend becomes down due to an increase in bad loans caused by the COVID. The best price for new investment in it is 1239. Current price is 1333.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Kotak_Mahindra_Bank_ATM.JPG",
      "type": "call"
    },
    {
      "id": 121,
      "date": "Sun Jul 19 2020",
      "title": "Aditya Puri becomes Highest Paid Banker for FY20",
      "description": "HDFC Bank Managing Director Aditya Puri has emerged as the highest-paid banker among the top lenders for FY2019-20, with a 38 percent jump in salary to Rs 18.92 crore. He earned an additional Rs 161.56 crore by exercising stock options during the year. He is set to retire in October this year on attaining the age of 70, had earned Rs 42.20 crore by exercising stock options in 2018-19. The current stock price of HDFC Bank is 1103.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/7d/An_HDFC_Bank_Branch.jpg",
      "type": "news",
      "fullArticleLink": "",
      "fullArticleName": ""
    },
    {
      "id": 122,
      "date": "Sun Jul 19 2020",
      "title": "HDFC Bank Q1 FY20-21 results",
      "description": "Private lender HDFC Bank posted a 19.58 percent rise in net profit to Rs 6,658.62 crore for the quarter one (Q1) of FY20. The figure stood at Rs 5,568.16 crore in the same quarter of the previous financial year (FY). The net interest income of the Bank grew 17.80 percent from last year to Rs 15,665.40 crore in Q1 of FY20. Provisions increased 48.89 percent from last year to Rs 3,891.52 crore. The overall results of a Bank are good.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/4/4e/HDFC_Bank.jpg",
      "type": "news"
    },
    {
      "id": 123,
      "date": "Mon Jul 20 2020",
      "title": "SBI Card FY20-21 Q1 results",
      "description": "SBI Card posted a 13.8 percent rise in net profit from Rs 345.59 crore in Q1 of FY19-20 to Rs 393.29 crore in Q1 of FY20-21. Total revenue from operation increased 4 percent from Rs 2,068.28 crore in Q1 of FY19-20 to Rs 2,152.20 crore in Q1 of FY20-21. The company posted a nearly 28 percent drop in total expenditure at Rs 134.98 crore in Q1FY20, over Rs 186.94 crore in Q1FY19. Its overall results are good. The stock price is 766.",
      "imageUrl": "https://c4.wallpaperflare.com/wallpaper/760/223/715/plastic-money-credit-cards-visa-wallpaper-preview.jpg",
      "type": "news",
      "videoUrl": "https://www.youtube.com/watch?time_continue=55&v=8Dex6YmtaAw"
    },
    {
      "id": 124,
      "date": "Mon Jul 20 2020",
      "title": "ACC Ltd FY20-21 Q1 results",
      "description": "Cement maker, ACC Ltd, reported a 40% fall in net profit from Rs 455 crore in Q1 of FY19-20 to Rs 270.95 crore in the same quarter of FY20-21. The company’s total sales decreased by 38% to Rs 2,520 crore during the Q1 of FY20-21, as against Rs 4059.28 crore in the same quarter last year. Sales volume declined by 33% from 4.9 million tonnes to 4.8 million tonnes. Its overall results are poor. The stock price of ACC Ltd is 1335.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/57/Factory_of_National_Cement_Share_Company.jpg",
      "type": "news",
      "videoUrl": "https://www.youtube.com/watch?time_continue=15&v=uhvReICx3Oo"
    },
    {
      "id": 125,
      "date": "Wed Jul 22 2020",
      "title": "Unichem Laboratories drug gets USFDA permission",
      "description": "Drug firm Unichem Laboratories has received approval from the United States Food and Drug Administration (USFDA) for its Amiodarone tablets used to treat an irregular heartbeat. The approved drug is a generic version of Wyeth Pharmaceuticals incorporated Cordarone tablets. The company product will be commercialized from its Ghaziabad, Uttar Pradesh, plant. The current stock price of Unichem Laboratories Limited is 208.",
      "imageUrl": "https://pixnio.com/free-images/science/medical-science/medicines-drugs/antibiotic-drug-capsules-725x544.jpg",
      "type": "news",
      "fullArticleLink": "https://www.cnbctv18.com/healthcare/unichem-lab-gets-usfda-nod-for-drug-to-treat-irregular-heartbeat-6412801.htm",
      "fullArticleName": "Cnbctv18"
    },
    {
      "id": 126,
      "date": "Wed Jul 22 2020",
      "title": "Britannia sales expanded by 25% during lockdown",
      "description": "Britannia Industries the maker of Good Day and Tiger biscuits expanded sales by 25%, an 8-year high and doubled profit, helped by a rise in at-home consumption of packaged foods during the lockdown. The company will invest ₹700 crore to open more factories as demand for packaged food is more than production capacity. The current stock price of Britannia Industries Ltd is 3807.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/74/Britannia_industries_ltd_product.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/britannia-has-a-700-crore-plan-to-keep-good-days-going/articleshow/77073900.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 127,
      "date": "Wed Jul 22 2020",
      "title": "Dabur will become strategic partner of Eveready ",
      "description": "FMCG major Dabur's promoters, the Burman family, may soon become a strategic partner of the BM Khaitan group controlled Eveready Industries India Ltd (EIIL). The Burmans had already picked up a 19.8-per cent stake in the dry cell battery major Eveready through market operations in the last 12-15 months. Recently through a block deal share purchase of 8.8 percent took place by the Burmans. The stock price of Dabur India Ltd is 482.\n",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Dabur_honey_bottle.jpg",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/dabur-s-promoters-may-soon-become-strategic-partner-of-eveready-industries-120072101046_1.html",
      "fullArticleName": "Business Standard "
    },
    {
      "id": 128,
      "date": "Thu Jul 23 2020",
      "title": "RIL stock closed at a record high today ",
      "description": "Reliance Industries Ltd (RIL) stock closed at a record high of Rs 2,076, up 3.59 percent on the NSE. Amazon wants to buy a 9.9 percent strategic stake in Reliance Retail for JioMart. JioMart, the e-commerce venture of Reliance's retail arm, was launched in May and poses a formidable challenge to Amazon.com's local unit and Walmart incorporated Flipkart. Plans of scaling JioMart to a much bigger level by including more local shops.\n",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Rohit_Mehta_Reliance_smart_print_shoot_pics.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/markets/stocks/news/ril-spikes-4-on-buzz-around-stake-sale-in-reliance-retail/articleshow/77128538.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 129,
      "date": "Thu Jul 23 2020",
      "title": " RIL crossed Rs 13 lakh crore mark of m-cap today",
      "description": "Reliance Industries Ltd (RIL) became the first Indian company to cross-market capitalization (m-cap) of Rs 13 lakh crore. The company's achievement comes a day after its Chairman and Managing Director (CMD) Mukesh Ambani became the world's fifth-richest person. Mr. Ambani surpassed ace American investor Warren Buffett to take the fifth spot on business magazine Forbes' real-time ranking of billionaires.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/d9/RelianceMart5.JPG",
      "type": "news",
      "fullArticleLink": "https://www.ndtv.com/business/reliance-share-price-hits-new-high-becomes-first-company-with-rs-13-trillion-m-cap-as-mukesh-ambani-fifth-richest-person-2267654",
      "fullArticleName": "Ndtv Profit"
    },
    {
      "id": 130,
      "date": "Fri Jul 24 2020",
      "title": "Maruti started bookings of petrol version S-Cross ",
      "description": " Maruti Suzuki has started bookings for the petrol version of S-Cross which is planned for launch next month. The model comes with a 1.5-litre BSVI-compliant petrol engine equipped with smart hybrid technology. The model earlier used to come only with a diesel engine option. S-Cross has been appreciated by over 1.25 lakh customers for its premium interiors, stylish and masculine design. The current stock price of Maruti is 5990.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/a6/2018_Suzuki_SX4_S-Cross_SZ5_DDIS_Allgrip_1.6.jpg",
      "type": "news",
      "fullArticleLink": "https://www.cardekho.com/india-car-news/maruti-suzuki-scross-petrol-booking-open-ahead-of-august-5-launch-25856.htm",
      "fullArticleName": "Cardekho"
    },
    {
      "id": 131,
      "date": "Fri Jul 24 2020",
      "title": "Asian Paints FY20-21 Q1 results",
      "description": "Asian Paints consolidated profit for June quarter fall 66.7 percent year-on-year (YoY) to Rs 218.45 crore from Rs 655.44 crore in the same quarter last year. Profit before tax (PBT) fell 70.2 percent for the quarter to Rs 305.76 crore from Rs 1,025.24 crore. Revenue from operations decreases 42.7 percent from Rs 5,104.72 crore to Rs 2,922.66 crore in FY20-21 Q1. Its overall results are bad. Its stock price is 1717.",
      "imageUrl": "https://p1.pxfuel.com/preview/552/346/472/watercolor-paint-colors-art-drawing-design.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/earnings/asian-paints-q1-profit-falls-67-but-beats-estimates-5593091.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 132,
      "date": "Tue Jul 28 2020",
      "title": "MCX stock gives a 37% return to investors ",
      "description": "Multi Commodity Exchange of India Ltd (MCX) is an independent commodity exchange of India. It was established in 2003 and is based in Mumbai. Its stock price rises by 37% from 1258 to 1724 in 1 month.  Its price was 1258 on 29/6/2020. The stock currently trading in 1724. Means price is increased by Rs 466 in a small duration. MCX offers trading in gold, non-ferrous metals, silver, energy, and many agricultural commodities.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/63/MCX_Warszawa_ul_Gotarda.jpg",
      "type": "news"
    },
    {
      "id": 133,
      "date": "Wed Aug 05 2020",
      "title": "Lupin launches COVID drug at Rs 49 per tablet",
      "description": "Drug major Lupin announced the launch of its Favipiravir drug under the brand name 'Covihalt' for the treatment of patients with mild to moderate COVID- 19 symptoms at Rs 49 per tablet in India. The drug is available as 200 mg tablets in the form of a strip of 10 tablets. Sun Pharma company had launched a Favipiravir drug at Rs 35 per tablet in India. The current stock price of Lupin Limited is 928.",
      "imageUrl": "https://c1.wallpaperflare.com/preview/262/177/123/pills-tablets-medicine-medication.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/business/lupin-launches-covid-19-drug-favipiravir-in-india-at-rs-49-per-tablet-5648551.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 134,
      "date": "Sat Aug 22 2020",
      "title": "Trading call on a Bata stock",
      "description": "The BATA stock chart shows a downtrend for the last 2 months and 10 days. Its trend is reversed from down to up after crossing a price of 1297. Try to buy a stock at the current level with a target of 1357. Put a stop loss of 1253. Time Horizon of a trade is 10-20 days. The current stock price of BATA is 1307.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/88/Bata_Store.jpg",
      "type": "call"
    },
    {
      "id": 135,
      "date": "Thu Oct 01 2020",
      "title": "Ashok Leyland sales declined by 5% in September",
      "description": "Hinduja Group firm Ashok Leyland reported a 5 percent decline in total commercial vehicle sales from 8,780 units to 8,344 units in September this year. Its total heavy and medium commercial vehicle sales were down 23 percent at 3,642 units as compared to 4,744 units in the year-ago month. But the company's light commercial vehicle sales were up by 17 percent. The current stock price of Ashok Leyland Ltd is 76.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Ashok_leyland_bus_2009.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/auto-news/ashok-leyland-reports-5-decline-in-commercial-vehicle-sales-in-sep-at-8344-units/articleshow/78427214.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 136,
      "date": "Thu Oct 01 2020",
      "title": "Hero MotoCorp sales increased by 17% in September",
      "description": "The country's largest two-wheeler maker Hero MotoCorp reported a 17 percent increase in sales from  6,12,204 units to 7,15,718 units in September this year. The company sold 18,14,683 units in the second quarter (July-September) of the current financial year despite the disrupted network of the components supply chain due to the non-availability of labor. The current stock price of Hero Motocorp Ltd is 3,155.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Optima_Plus_%28Hero_Electric%2C_India%29.jpg",
      "type": "news",
      "fullArticleLink": "https://www.moneycontrol.com/news/technology/auto/hero-motocorp-reports-17-increase-in-sales-at-715718-units-in-september-5912421.html",
      "fullArticleName": "Moneycontrol"
    },
    {
      "id": 137,
      "date": "Fri Oct 02 2020",
      "title": "Royal Enfield sales rise by 1% in September",
      "description": "Motorcycle maker Royal Enfield reported a 1 percent increase in its total sales from 59,500 units to 60,041 units in September this year. Its domestic sales were increased by 2 percent from 54,858 units to 55,910 units. But, the company's exports were down 11 percent to 4,131 units as compared to 4,642 units in the year-ago month. The current stock price of Eicher Motors Ltd(the parent company of Royal Enfield) is 2200.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Royal_Enfield_Classic_350_%282017_Model_Year%29.jpg",
      "type": "news",
      "fullArticleLink": "https://www.business-standard.com/article/companies/royal-enfield-s-total-sales-increase-1-to-60-041-units-in-september-120100200281_1.html",
      "fullArticleName": "Business Standard"
    },
    {
      "id": 138,
      "date": "Sun Oct 04 2020",
      "title": "Likhitha Infrastructure Ltd IPO is open to apply",
      "description": "Likhitha Infrastructure Ltd is an oil and gas pipeline infrastructure service provider in India. 3 primary business lines of the company are cross country pipelines, city gas distribution including CNG Station & maintenance of CNG/PNG services. It has clients in both private and public players such as ONGC, HCG, IndianOil, GAIL. The IPO price is ₹120 per share, the minimum lot size is 125 shares (15k), and listing on both BSE & NSE.",
      "imageUrl": "https://www.liveplanetnews.com/wp-content/uploads/2020/09/Likhitha-Infrastructure-IPO0A.jpg",
      "type": "news",
      "fullArticleLink": "https://groww.in/blog/likhitha-infrastructure-ipo/",
      "fullArticleName": "Groww.in"
    },
    {
      "id": 139,
      "date": "Mon Oct 05 2020",
      "title": "Sigma Solve IPO is also open to apply",
      "description": "Sigma Solve is an IT company that offers enterprise software development & services such as Web, E-commerce & Real-Time Development, BI, CRM, Digital Marketing, UI & UX Design, Automation Testing, and QA. It generates 100% of its revenues through exporting products & has offices across Florida (USA), Atlanta, & Australia. It is open for issue till 9th of October, priced at 45 per share & minimum quantity to buy is 3000 shares(₹135,000)",
      "imageUrl": "https://www.chittorgarh.com/images/ipo/sigma-solve-ltd-logo.png",
      "type": "news",
      "fullArticleName": "chittorgarh",
      "fullArticleLink": "https://www.chittorgarh.com/ipo/sigma-solve-ipo/1067"
    },
    {
      "id": 140,
      "date": "Tue Oct 20 2020",
      "title": "Trading call on a HCLTECH stock",
      "description": "The HCLTECH stock chart shows an uptrend from the last 6 months and 20 days. It crosses the resistance level of 879. Try to buy a stock at the current level with a target of 910. Put a stop loss of 868. The Time Horizon of a trade is 5-15 days. The current stock price of HCL Technologies Ltd is 880.65.",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/67/HCL_Tech_Noida_SEZ_Campus.png",
      "type": "call"
    },
    {
      "id": 141,
      "date": "Tue Oct 20 2020",
      "title": "Trading call on a MCX stock",
      "description": "The MCX Stock chart shows an uptrend from the last 7 months. It crosses the resistance level of 1788. Try to buy a stock at the current level with a target of 1850. Put a stop loss of 1765. The Time Horizon of a trade is 5-15 days. The current share price of the Multi Commodity Exchange of India Ltd (MCX) is 1789.",
      "imageUrl": "https://cdn.crediful.com/app/uploads/2016/11/gold-and-silver.jpg",
      "type": "call"
    },
    {
      "id": 142,
      "date": "Fri Oct 23 2020",
      "title": "Trading call on a HeroMotocorp stock",
      "description": "The HeroMotocorp stock chart shows an uptrend from the last 6 months and 20 days. It crosses the resistance level of 3090. Try to buy a stock at the current level with a target of 3150. Put a stop loss of 3080. The Time Horizon of a trade is 2-15 days. The current stock price of Hero Motocorp Ltd is 3114.",
      "imageUrl": "https://images.hindustantimes.com/auto/img/2020/07/01/600x338/Image_-_Hero_Xtreme_160R_1593522699860_1593597979081.jpg",
      "type": "call"
    },
    {
      "id": 143,
      "date": "Thu Oct 29 2020",
      "title": "Trading call on a Jubilant FoodWorks stock",
      "description": "The Jubilant FoodWorks stock chart shows an uptrend from the last 6 months and 15 days. It crosses the resistance level of 2188. Try to buy a stock at the current level with a target of 2274.\nPut a stop loss of 2170. The Time Horizon of a trade is 5-15 days The current share price of Jubilant FoodWorks Ltd is 2194.",
      "imageUrl": "https://images.livemint.com/img/2020/01/29/600x338/jubilanfoodworkks-kwfH--621x414@LiveMint_1580305696460.jpg",
      "type": "call"
    },
    {
      "id": 144,
      "date": "Fri Oct 30 2020",
      "title": "Trading call on a Reliance Industries stock",
      "description": "The Reliance Industries stock chart shows an uptrend from the last 7 months. It crosses the resistance level of 2030. Try to buy a stock at the current level with a target of 2100. Put a stop loss of 2020. The Time Horizon of a trade is 2-10 days. The current share price of Reliance Industries Limited is 2032.",
      "imageUrl": "https://content.indiainfoline.com/_media/iifl/img/misc/2015-02/23/full/reliance-industries-1424684356-3657300.jpg",
      "type": "call"
    },
    {
      "id": 145,
      "date": "Wed Nov 04 2020",
      "title": "Trading call on a UltraTech Cement stock",
      "description": "The UltraTech Cement stock chart shows an uptrend from the last 5 months and 15 days. It crosses the resistance level of 4565. Try to buy a stock at the current level with a target of 4650.\nPut a stop loss of 4550. The Time Horizon of a trade is 2- 10 days. The current share price of UltraTech Cement Ltd is 4568.",
      "imageUrl": "https://images.financialexpress.com/2019/04/cats-1454.jpg",
      "type": "call"
    },
    {
      "id": 146,
      "date": "Fri Nov 13 2020",
      "title": "Trading call on a Reliance Industries stock",
      "description": "The Reliance Industries stock chart shows an uptrend from the last 7 months. It crosses the resistance level of 1998. Try to buy a stock at the current level with a target of 2048. Put a stop loss of 1980. The Time Horizon of trade is 2-10 days. The current share price of Reliance Industries Limited is 2000.",
      "imageUrl": "https://bl.thgim.com/incoming/xcctym/article28688833.ece/alternates/WIDE_615/riljpg",
      "type": "call"
    },
    {
      "id": 147,
      "date": "Fri Nov 13 2020",
      "title": "Trading call on a Britannia Industries stock",
      "description": "The Britannia Industries stock chart shows an uptrend from the last 7 months and 10 days. It crosses the resistance level of 3514. Try to buy a stock at the current level with a target of 3800. Put a stop loss of 3486. The Time Horizon of trade is 1-2 months. The current share price of Britannia Industries Ltd is 3517.",
      "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2018-02/18/full/1518965938-4605.jpg",
      "type": "call"
    },
    {
      "id": 148,
      "date": "Sun Dec 13 2020",
      "title": "Cremica IPO opens on 15th December 2020",
      "description": "Mrs Bectors Food Specialities Ltd is one of the leading companies in the bakery and biscuit segment in North India. The company manufactures and sells biscuits under its brand name \"Mrs Bector's Cremica\" whereas bakery products are manufactured under the brand name of \"English Oven\". The issue is priced at ₹286 to ₹288 per equity share. The minimum order quantity is 50 Shares. The IPO opens on Dec 15, 2020, and closes on Dec 17, 2020.",
      "imageUrl": "https://restaurantindia.s3.ap-south-1.amazonaws.com/s3fs-public/2020-10/cremica.jpg",
      "type": "news",
      "fullArticleLink": "https://www.chittorgarh.com/ipo/mrs-bectors-food-ipo/1077/",
      "fullArticleName": "Chittorgarh"
    },
    {
      "id": 149,
      "date": "Tue Jan 19 2021",
      "title": "Indigo Paints IPO coming on 20th January 2021",
      "description": "Indigo Paints is one of the fastest-growing and the 5th largest company in the decorative paint industry in India. It is the first company that started manufacturing differentiated products like Metallic Emulsions, Bright Ceiling Coat Emulsions, Tile Coat Emulsions, and Floor Coat Emulsions.  The issue is priced at ₹1488 to ₹1490 per equity share. Its lot size is 10 Shares. The IPO opens on Jan 20, 2021, and closes on Jan 22, 2021.",
      "imageUrl": "https://5.imimg.com/data5/KK/CI/MY-9137468/indigo-paints-500x500.jpg",
      "type": "news",
      "fullArticleLink": "https://www.chittorgarh.com/ipo/indigo-paints-ipo/1079/",
      "fullArticleName": "Chittorgarh"
    },
    {
      "id": 150,
      "date": "Sun Jan 24 2021",
      "title": "Stove Kraft IPO opens on 25th January 2021",
      "description": "Stove Kraft Limited is one of the largest Kitchen appliance suppliers in India. The company manufactures and sells kitchen solutions under the brand name of \"Pigeon\" and \"Gilima\". In 2019, it also started manufacturing Pigeon LED products. Stove Kraft has manufacturing facilities in Bengaluru and Baddi. The issue is priced at ₹384 to ₹385 per equity share. Its lot size is 38 Shares. The IPO closes on Jan 28, 2021. ",
      "imageUrl": "https://images.moneycontrol.com/static-mcnews/2018/10/Screenshot_2018-10-08-19-25-00-307-770x433.jpg?impolicy=website&width=770&height=431",
      "type": "news",
      "fullArticleLink": "https://www.chittorgarh.com/ipo/stove-kraft-ipo/1081/",
      "fullArticleName": "Chittorgarh"
    },
    {
      "id": 151,
      "date": "Mon Jan 25 2021",
      "title": "Key points for good financials of a stock Part 1",
      "description": "1) Earnings per Share (EPS) tells the profitability of a stock. An increase in EPS is a good sign for a particular stock.\n2) If Book Value per Share (BVPS) increases the stock price will also increase.\n3) Higher the Return on equity (ROE) of a company it will give better returns to investors.\n4) Debt to Equity Ratio should be less for low risk and better investment.\n5) If Earnings before interest & taxes (EBIT) increases are good.\n",
      "imageUrl": "https://previews.123rf.com/images/kchung/kchung1409/kchung140900353/31394723-key-icon-target-with-darts-hitting-on-it-over-white.jpg",
      "type": "learn"
    },
    {
      "id": 152,
      "date": "Fri Jan 29 2021",
      "title": "Open free Demat and Trading account with Upstox",
      "description": "Upstox is one of India’s fastest-growing brokers. A reliable and easy-to-use trading platform with paperless account opening. It has raised Rs 177 crore from New York-based venture capital firm Tiger Global Management. Upstox is backed by Ratan Tata. It will be charged a Zero brokerage fee for equity delivery trades for life and provides unlimited brokerage credit for 30 days. Click on the read more link below to open a free account.",
      "imageUrl": "https://top10onlinebrokers.com/wp-content/uploads/2017/11/upstox_logo.jpg",
      "type": "news",
      "fullArticleLink": "https://upstox.com/open-account/?f=HM7248"
    },
    {
      "id": 153,
      "date": "Fri Feb 26 2021",
      "title": "Bond yield rises results fall in an Equity market",
      "description": "Bond yield is the return an investor gets on that bond. The sudden rise in domestic and global bond yields recently reduce the enthusiasm of equity market participants. A higher return on treasury bonds in the US leads investors to move their asset allocation from the Equity market to the US Treasury. This will decrease the Foreign portfolio investment (FPIs) flow. Currently, Nifty 50 and Bank nifty are down by 540 and 1700 points.",
      "imageUrl": "https://akm-img-a-in.tosshub.com/sites/btmt/images/stories/marketfall_660_070819013322.jpg",
      "type": "news",
      "fullArticleLink": "https://indianexpress.com/article/explained/explained-what-rise-in-bond-yield-means-for-investors-and-govt-7205054/",
      "fullArticleName": "Indian Express"
    },
    {
      "id": 154,
      "date": "Sat Mar 27 2021",
      "title": " The auto components sector will bounce back",
      "description": "The automotive components sector will see a revenue rebound of 21-23% in the next fiscal year. Because domestic and export demand revives after two straight contractions. The Rs 3.2 lakh crore sector derives 60% of its revenue from automobile original equipment manufacturers (OEMs). The ongoing rebound in economic activity will drive a strong recovery for OEMs next fiscal. Some of the sectors are Bosch Ltd, Minda Industries Ltd etc.",
      "imageUrl": "https://static.businessworld.in/article/article_extra_large_image/1575630948_mszzKY_1218_auto.jpg",
      "type": "news",
      "fullArticleLink": "https://economictimes.indiatimes.com/industry/auto/auto-components/auto-components-sector-set-for-a-rebound/articleshow/81704407.cms",
      "fullArticleName": "Economic Times"
    },
    {
      "id": 155,
      "date": "Sun Mar 28 2021",
      "title": "Important facts of Godrej Industries Ltd company",
      "description": "1) It is India's leading manufacturer of oleochemicals (Chemical compounds derived from natural fats, vegetable, and animal oils).\n2) The company's raw material is vegetable oils.\n3) It manufactures fatty acids, glycerin, fatty alcohols, surfactants etc.\n4) It has a manufacturing facility at Valia in Gujarat.\n5) Company is also engaged in the business of Real Estate and Finance Investments.\n6) Its head office in Mumbai, Maharastra.\n",
      "imageUrl": "https://www.godrejindustries.com/chemicals/Resources/images/chemicals/products/product-banner.jpg",
      "type": "news"
    }
  ]
}